{
  "asOf": "2025-09-08T06:21:38Z",
  "items": [
    {
      "id": "e05e739ec0fbf3af",
      "title": "Madani  project at military camps to yield six tonnes of produce annually",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271953/madani-project-military-camps-yield-six-tonnes-produce-annually",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T14:14:01Z",
      "summary": "KUALA LUMPUR: The Madani Economy project in armed forces camps nationwide is expected to yield up to six tonnes of produce annually and generate income of RM604,000 over the next two and a half years.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said the programme involves families of armed forces personnel and will be implemented in phases across all 90 military camps nationwide to benefit t",
      "content": "KUALA LUMPUR: The Madani Economy project in armed forces camps nationwide is expected to yield up to six tonnes of produce annually and generate income of RM604,000 over the next two and a half years.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said the programme involves families of armed forces personnel and will be implemented in phases across all 90 military camps nationwide to benefit their communities.\n\"Initially, the project was run on a trial basis to gauge the interest of personnel's wives, and it turned out that demand was high.\n\"The government has allocated RM10 million for this initiative. For the stingless bee honey (madu kelulut) project, Boustead Plantations will cover half the cost of the hives while the government will bear the other half.\n\"We are starting with 22 camps, before gradually expanding it to 90 camps within two and a half years,\" he told reporters at a press conference after visiting the army's Western Field Command Headquarters in Sungai Besi, here.\nHe said all harvested produce would be purchased by Boustead Plantations Bhd, a subsidiary of the Armed Forces Fund Board (LTAT), to be processed into higher-value products. The profits from the company, he added, would also benefit armed forces personnel in the future.\n\"For the herbal planting initiative, it began here at Kem Perdana, Sungai Besi, with pandan, lemongrass and now ulam raja, while the company interested in purchasing them is a start-up from Universiti Putra Malaysia (UPM). Once the entire ecosystem is ready, then it will be suitable to implement it elsewhere,\" he said.\nKhaled said that so far, Mahkota Camp in Kluang had already begun harvesting, providing a modest income but with strong potential to yield significant returns for about 20 families involved in the Madani Economy project there in the near future.\nHe also hoped that the programme would create opportunities for armed forces' families to participate in government-driven economic activities, ensuring that military camps would not be left out of the initiative's benefits.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "9a4d19d1f1c7fa2d",
      "title": "Sorensen-McGee scores a hat-trick as Women's World Cup holders New Zealand thrash Ireland",
      "url": "https://www.nst.com.my/sports/others/2025/09/1271951/sorensen-mcgee-scores-hat-trick-womens-world-cup-holders-new-zealand",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T14:12:36Z",
      "summary": "LONDON: Teenage rising star Braxton Sorensen-McGee grabbed a hat-trick of tries as reigning champions New Zealand secured top spot in Pool C of the Women's Rugby World Cup with an emphatic 40-0 rout of Ireland in Brighton.\nVictory saw the record six-time World Cup winners gain revenge for their shock 29-27 loss to Ireland at last year's WXV tournament in Vancouver, with 18-year-old wing Sorensen-M",
      "content": "LONDON: Teenage rising star Braxton Sorensen-McGee grabbed a hat-trick of tries as reigning champions New Zealand secured top spot in Pool C of the Women's Rugby World Cup with an emphatic 40-0 rout of Ireland in Brighton.\nVictory saw the record six-time World Cup winners gain revenge for their shock 29-27 loss to Ireland at last year's WXV tournament in Vancouver, with 18-year-old wing Sorensen-McGee leading the way on Sunday as the Black Ferns scored six tries in total.\nBoth teams had already reached the quarter-finals before kick-off in their concluding pool game on England's south coast, with the only outstanding issue the finishing order.\nBut New Zealand's third win from as many group matches means they will now face the loser of Sunday's Pool D clash between France and South Africa in the last eight.\n\"Job done, pretty proud of that one,\" said New Zealand coach Allan Bunting.\n\"Scott (Bemand) and the Irish ladies really threw everything at us and put us under a lot of pressure but we were formidable on D (defence), we didn't want to let them past and that's what it's going to take to go further in this competition.\"\nIreland, who will now take on the Pool D winners in the last eight, were unable to break down a dogged New Zealand defence, having defiantly stared down the Black Ferns' pre-match Haka challenge.\nA tough day for Ireland was made worse by full-back Stacey Flood leaving the field in a protective boot and centre Eve Higgins going off the pitch for a head injury assessment.\n\"New Zealand are a physical team so we've got to find a way to cross the whitewash when we get those opportunities,\" said Ireland coach Bemand.\nEarlier in Pool C, Japan bid farewell to this World Cup by overturning a nine-point deficit at half-time to beat Spain 29-21 in York.\nBoth sides were bidding for their first win of the tournament and Spain were well-placed when leading 14-5 at the break.\nJapan, however, scored three tries in 16 minutes in the second half before Spain lost Anne Fernandez de Corres to a yellow card.\nJapan coach Lesley McKenzie was proud of how her side regrouped at half-time.\n\"(I told them) to collect all the positives, which were numerous in the first half, and keep some patience and we will get the rewards in the second half,\" she said.\n\"We were in control in terms of territory and possession but a little impatient, which is one of our vices... have some faith in the process, and we got there..\"\nIn another match between two previously winless sides at the tournament, Italy hammered Brazil, the first South American team to compete at a Women's Rugby World Cup, 64-3.\nLe Azzurre ran in 12 tries, six in each half, with Francesca Granzotto and Vittoria Ostuni Minuzzi both scoring hat-tricks.\nFor Italy there was the frustration of what might have been after losses to France and South Africa put paid to their quarter-final hopes.\nNevertheless, Italy coach Fabio Roselli said: \"I am very proud. We have a lot of young players, who are at their first Rugby World Cup. They show great potential.\"\nBrazil counterpart Emiliano Caffera was proud that his side had shown \"the world Brazil has rugby 15s\" but pleaded for an enhanced fixture schedule in order to improve after a third heavy defeat in England.\n\"Now what we need is more games, more tournaments, more support,\" he insisted. \"We play two or three games a year; I want to play nine, 10, 12 games a year.\" - AFP\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "c310fa34ac257886",
      "title": "No agreement yet on Sulawesi Sea joint development with Indonesia — Tok Mat",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271949/no-agreement-yet-sulawesi-sea-joint-development-indonesia-%E2%80%94-tok-mat",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T14:10:02Z",
      "summary": "KUALA LUMPUR: The proposed joint development with Indonesia in Block ND6/ND7 of the Sulawesi Sea is still at the preliminary stage and has not been finalised.\nForeign Minister Datuk Seri Mohamad Hasan said that so far no agreement has been reached between the two countries and official discussions on the proposal have not yet begun.\n\"However, I must emphasise here that the matter is still at the p",
      "content": "KUALA LUMPUR: The proposed joint development with Indonesia in Block ND6/ND7 of the Sulawesi Sea is still at the preliminary stage and has not been finalised.\nForeign Minister Datuk Seri Mohamad Hasan said that so far no agreement has been reached between the two countries and official discussions on the proposal have not yet begun.\n\"However, I must emphasise here that the matter is still at the preliminary consideration stage to explore the possibility of such cooperation, and indeed nothing has been finalised yet,\" he said during a question and answer session at Dewan Negara today.\nHe was responding to a question by Senator Tan Sri Anifah Aman who wanted to know the status of discussions between Malaysia and Indonesia regarding Block ND6/ND7 and its implications on the country's sovereignty.\nMohamad said discussions on the maritime delimitation between Malaysia and Indonesia were held through the Technical Meeting on Maritime Boundaries Delimitation between Malaysia and the Republic of Indonesia, which was established in 2005.\nHe said the government was always cautious and made a comprehensive assessment of any proposed solution, including economic cooperation, to ensure that the country's sovereignty was not affected.\n\"The government remains committed to refining and seeking an agreement on this matter through negotiations through existing mechanisms and ensuring that the country's sovereignty, sovereign rights and interests would always be defended,\" he said.\nResponding to Anifah's supplementary question on the impact of the proposal on diplomatic relations, Mohamad stressed that Malaysia-Indonesia relations remained close.\n\"The Malaysia-Indonesia relationship is very close, very good, as I mentioned in the Dewan Rakyat the other day, the Malaysia-Indonesia relationship is 98 per cent very good in the best possible conditions,\" he said.\nHe explained that although the maritime demarcation negotiations were still at the technical stage, many agreements had been reached, including the land demarcation in Sabah.\nHe added that trade between the two countries had recorded positive growth through various agreements reached in the annual leaders' talks, including the opening of border trade between Sarawak-Indonesia and Sabah-Indonesia.\n\"We want to open the Tebedu Border so that it becomes a trading centre... this has already been opened, has been agreed upon and this will further boost trade relations between Malaysia and Indonesia,\" he said. — BERNAMA\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "8b50e974968b06de",
      "title": "'Malaysia gave the remote control to their opponents'",
      "url": "https://www.nst.com.my/sports/hockey/2025/09/1271947/malaysia-gave-remote-control-their-opponents",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T14:09:08Z",
      "summary": "KUALA LUMPUR: While Malaysia's  men's hockey team showed improvement at last week's Asia Cup in Bihar, India, the sad thing is that they did not live up to expectations.\nWorld No. 12 Malaysia are ranked No. 2 in Asia, but coach Sarjit Singh's men failed to qualify for the Asia Cup final.\nThe Speedy Tigers finished third in the continental tournament after a thumping 4-1 win over China. World No. 7",
      "content": "KUALA LUMPUR: While Malaysia's  men's hockey team showed improvement at last week's Asia Cup in Bihar, India, the sad thing is that they did not live up to expectations.\nWorld No. 12 Malaysia are ranked No. 2 in Asia, but coach Sarjit Singh's men failed to qualify for the Asia Cup final.\nThe Speedy Tigers finished third in the continental tournament after a thumping 4-1 win over China. World No. 7 India beat world No. 13 South Korea 4-1 in the final, and qualified for next year's World Cup in the Netherlands and Belgium.\nMalaysia had gone to Bihar, eyeing that sole World Cup ticket, but it proved to be unachievable.\nNonetheless, the Speedy Tigers didn't finish empty-handed this time. Sarjit got his first podium finish since taking charge of the national team last March. The team returned with a bronze and plenty of goals to gush about.\nMalaysia scored a whopping 33 goals (26 field goals, six penalty corners and one penalty stroke) and conceded 11 in seven matches. Akhimullah Anuar Esook plundered a total of 12 goals to be the Asia Cup's top scorer.\nFormer India national coach V. Baskaran, in an interview with Timesport, said the Malaysian team showed improvement in their games and were on track for next year's Asian Games.\n\"Malaysia have some skilful players with the ability to score goals. Malaysia scored the most number of field goals (26) in the tournament. It's a good indication for them,\" said Baskaran, who captained India to the 1980 Moscow Olympics gold.\n\"Malaysia, however, need to overcome their mental strength and have belief in  themselves... that they can beat any team in Asia.\n\"The Malaysian team have the tendency to fail to secure a win despite leading in matches.\n\"Malaysia also need to improve their midfield, which made errors against South Korea in the Super Four. Malaysia were leading 3-1 when their midfield made errors in the last 17 minutes to allow Korea to score three goals in seven minutes.\n\"This should not have happened. The midfield should have cut off the attacks from Korea. There's no leadership in midfield, which is an important link between defence and the forward line.\n\"When Malaysia were leading 3-1, the forwards should have scored one more goal to finish off the match. But Malaysian players had the tendency to lose ball possession and allow their opponents to control the match. It's like giving the remote control to their opponents.\n\"If Malaysia can improve all their shortcomings, then they will be a team to be reckoned with in tournaments,\" added  Baskaran.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "475d0eb2a074377e",
      "title": "De Bruyne and Doku grab two each as Belgium hit Kazakhstan for six",
      "url": "https://www.nst.com.my/sports/football/2025/09/1271945/de-bruyne-and-doku-grab-two-each-belgium-hit-kazakhstan-six",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T14:05:28Z",
      "summary": "BRUSSELS: Kevin De Bruyne underlined his talismanic role for Belgium with a stunning goal to break the deadlock and set his side on their way to a comfortable 6-0 win over Kazakhstan in their World Cup qualifier on Sunday.\nIt was threatening to become a frustrating night at the Constant Vanden Stock Stadium for the Belgians before the 42nd-minute strike, but after that they were able to go on and ",
      "content": "BRUSSELS: Kevin De Bruyne underlined his talismanic role for Belgium with a stunning goal to break the deadlock and set his side on their way to a comfortable 6-0 win over Kazakhstan in their World Cup qualifier on Sunday.\nIt was threatening to become a frustrating night at the Constant Vanden Stock Stadium for the Belgians before the 42nd-minute strike, but after that they were able to go on and register a comfortable victory with both De Bruyne and Jeremy Doku scoring twice.\nBelgium have 10 points from four games in Group J, ahead of Wales on goal difference but trailing leaders North Macedonia, who beat Liechtenstein 5-0 earlier on Sunday, by a point. North Macedonia and Wales have played five matches each, however.\nThe group winners qualify automatically for next year's World Cup while the runners-up go into a playoff.\nKazakhstan, who have now lost four of their five group games, defended stoutly initially and goalkeeper Mukhamedjan Seysen made several stops before a series of clever touches set up De Bruyne's thumping shot into the top corner.\nLeandro Trossard played an overhead flick to keep Belgium in possession and then Charles De Ketelaere backheeled the ball into De Bruyne's path, followed by a typically powerful and accurate effort for his 33rd international goal.\nStraight away Belgium doubled the lead with Doku hammering home a shot from the left to send them into the break 2-0 up.\nBelgium went further ahead up in the 51st minute as captain Youri Tielemans' cross to the back post was played back across the face of goal by Doku for Nicolas Raskin to touch home for his first international goal.\nDoku grabbed his second on the hour mark with a burst of acceleration that took him past the defence before finding the net with a left-footed strike from an acute angle.\nThe 34-year-old De Bruyne added their fifth in the 84th minute after being set up by Alexis Saelemaekers.\nFullback Thomas Meunier's strike three minutes later completed a second successive 6-0 win for the Belgians who did the same away against Liechtenstein on Thursday. - Reuters\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "5cce3f022131e03f",
      "title": "Super Spain hit six as Germany get first World Cup qualifying win",
      "url": "https://www.nst.com.my/sports/football/2025/09/1271943/super-spain-hit-six-germany-get-first-world-cup-qualifying-win",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:59:59Z",
      "summary": "PARIS: Mikel Merino scored a hat-trick as a majestic Spain thumped Turkey 6-0 away in World Cup qualifying on Sunday, while a brilliant Florian Wirtz free-kick helped Germany beat Northern Ireland 3-1 to get their bid up and running.\nEuropean champions Spain were in unstoppable form in the central Turkish city of Konya, claiming their second biggest-ever away win in World Cup qualifying as Arsenal",
      "content": "PARIS: Mikel Merino scored a hat-trick as a majestic Spain thumped Turkey 6-0 away in World Cup qualifying on Sunday, while a brilliant Florian Wirtz free-kick helped Germany beat Northern Ireland 3-1 to get their bid up and running.\nEuropean champions Spain were in unstoppable form in the central Turkish city of Konya, claiming their second biggest-ever away win in World Cup qualifying as Arsenal midfielder Merino scored his first professional hat-trick.\nBarcelona playmaker Pedri Gonzalez opened the scoring inside six minutes and later completed the scoring, with Ferran Torres netting the visitors' other goal.\nThe quality of Merino's strikes was remarkable, with his first coming at the end of a superb team move and his second a controlled finish from a Pedri assist. He completed his triple with a curling shot into the top corner.\nThe one blemish on the night's work for Spain was the withdrawal of Nico Williams due to an apparent thigh injury, but Luis de la Fuente's team are already clear at the top of qualifying Group E with six points from two games.\n\"I'm very happy for winning, to pick up six points, for doing it in this way, and for scoring three goals, which is not normal – the first hat-trick of my career,\" said Merino.\nThe group winners will qualify directly for the finals, with the runners-up progressing to a play-off phase.\nGeorgia and Turkey come next on three points each, with the former beating Bulgaria 3-0 in Tbilisi thanks to goals by captain Khvicha Kvaratskhelia, Nika Gagnidze and Georges Mikautadze.\nGermany were under pressure after losing their opening qualifier 2-0 in Slovakia on Thursday, and it took them until the final quarter of their home meeting with Northern Ireland in Cologne before they could secure the victory.\nSerge Gnabry gave the hosts an early lead only for Isaac Price of West Bromwich Albion to equalise before half-time.\nThe home fans were unhappy with Julian Nagelsmann's team, but they eventually retook the lead on 69 minutes when substitute Nadiem Amiri turned in David Raum's cross.\nLiverpool star Wirtz, playing in his home city, then took centre stage by converting a free-kick in style to seal Germany's first win in Group A.\n\"We knew it was a catastrophe (in the) last game and we wanted to do things better,\" Wirtz told Germany's RTL network.\n\"It was a good performance (which) we can definitely build on.\"\nThey and Northern Ireland both have three points, while Slovakia lead the way on six points after Tomas Rigo's late goal clinched a 1-0 victory in Luxembourg.\nMemphis Depay became the Netherlands' all-time top goalscorer with a brace in their 3-2 win in Lithuania in Group G.\nDepay, who now plays in Brazil for Corinthians, scored his 51st and 52nd international goals to move clear of Robin van Persie, with whom he had been tied in first place on half a century of strikes for the Oranje.\nThe 31-year-old turned in Cody Gakpo's cutback for the opener before Quinten Timber netted the second goal for the Netherlands in Kaunas.\nThey appeared to be on easy street, but Torino midfielder Gvidas Gineitis pulled one back and Edvinas Girdvainis headed in the equaliser before the break for the team ranked 143rd in the world.\nDepay, though, rescued the Netherlands by heading in a Denzel Dumfries cross just after the hour mark.\nRonald Koeman's side have 10 points after four matches and are ahead of Poland on goal difference with a game in hand.\nPoland won 3-1 at home to Finland in Chorzow with Matty Cash, captain Robert Lewandowski and Jakub Kaminski netting before Benjamin Kaellman pulled one back for Finland, who are three points behind the leading duo in third.\nBelgium recorded a second 6-0 win in as many matches in Group J as they swept aside Kazakhstan at Anderlecht's stadium in Brussels.\nKevin De Bruyne scored twice and is now his country's second-top goal-scorer of all time behind Romelu Lukaku.\nJeremy Doku of Manchester City also bagged a brace, with Nicolas Raskin and Thomas Meunier netting the other goals.\nNorth Macedonia beat Liechtenstein 5-0 in the same group and they are top with 11 points from five matches, one ahead of Belgium – who have a game in hand – and Wales. - AFP\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "338cbfcc24501dd3",
      "title": "#SHOWBIZ: Celebration of Asean indie culture in Lenggong",
      "url": "https://www.nst.com.my/lifestyle/groove/2025/09/1271941/showbiz-celebration-asean-indie-culture-lenggong",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:56:33Z",
      "summary": "THE serene setting of Resort Tasik Raban in Lenggong, Perak, was transformed into a buzzing cultural hub recently as TAPAUfest celebrated its 7th edition over two days.\nDrawing more than 2,000 attendees from across Malaysia and Southeast Asia, the festival blended music, arts, food, and outdoor activities to solidify its reputation as a beloved indie gathering.\nWith the stunning backdrop of Tasik ",
      "content": "THE serene setting of Resort Tasik Raban in Lenggong, Perak, was transformed into a buzzing cultural hub recently as TAPAUfest celebrated its 7th edition over two days.\nDrawing more than 2,000 attendees from across Malaysia and Southeast Asia, the festival blended music, arts, food, and outdoor activities to solidify its reputation as a beloved indie gathering.\nWith the stunning backdrop of Tasik Raban's lake and surrounding mountains, the festival was a feast for the senses.\nCurated by Pekan Pop Up, the Warung (food & beverage) and Pasar (indie marketplace) areas offered a diverse array of affordable eats and unique creative goods, including the highly sought-after TAPAUfest × Humblezing collaboration merchandise.\nBeyond the main grounds, festival-goers could also immerse themselves in nature by camping out for two nights at Santuy Campsite or Slow Cub Camp, complete with intimate bonfire performances.\nHosted by Iedil Dzuhrie and Nadia Nash, the main music stage, Pentas, featured an impressive line-up of local and regional talent.\nDay 1 was packed with high-energy acts. Malaysian heroes Raksar and Thai indie-rockers KIKI kept the crowd moving, while Jogjakarta's Skandal delivered their international debut performance.\nThe day also featured a unique collaboration between Seru and poet Wani Ardy, and a special appearance by Heidi Moru with Malaysian band FUGŌ.\nThe night culminated with a theatrical performance by Indonesia's Sal Priadi, a fitting end to a magical first day.\nDay 2 continued the momentum. Singapore's Cactus Cactus opened with heavy sounds, followed by the \"healing chairs\" soundtrack of Malaysia's Okirama.\nThe dance floor lit up again with Indonesia's White Chorus before Malaysia's Insomniacks had the younger crowd in a massive sing-along.\nEmotions ran high during Perunggu's set, but the biggest moment belonged to Malaysian indie legends Couple. The band reunited their classic \"Top of the Pops\" line-up for the first time since 2006 to perform a special 14-song set celebrating their 30th anniversary, drawing the loudest cheers of the weekend.\nAside from the music performances, the Bengkel (workshops) and Layar (film screenings) sections provided engaging activities for everyone.\nThe Bengkel sessions, which included talks like \"The Struggles of Finding Your Visual Identity\" and an \"Ada Apa Dengan Asean\" discussion, highlighted the festival's regional focus.\nAttendees also got hands-on with rubber-cut printmaking and mini-zine making, while the Layar stage showcased indie works from the SEA Short Film Festival.\nThis year, the festival also introduced Kembara, an outdoor adventure programme featuring kayaking, boat rides, and yoga sessions.\nThoughtful touches like a flutist serenading the crowd at sunset and free water refill stations further enhanced the attendee experience.\n\"The community has grown bigger this year with Asean, and it's exciting to experience the magic that happens when the indie community—local and regional—works together for a cause we all share and truly care about,\" said TAPAUfest festival director, Ahmad Faris, in a statement.\nTAPAUfest 2025 ASEAN was organised by TAPAUasia Sdn Bhd with key support from Asean and Tourism Malaysia.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "195b1d6493043f1d",
      "title": "Govt to amend Orang Asli Act to empower community, says Zahid",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271939/govt-amend-orang-asli-act-empower-community-says-zahid",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:54:22Z",
      "summary": "KUALA LUMPUR: The government has assured it will continue to empower the Orang Asli community through amendments to the law and new approaches so that they can stand on an equal footing with other races in the country, said Deputy Prime Minister Datuk Seri Dr Ahmad Zahid Hamidi.\nZahid who is also Rural and Regional Development Minister said his experience when visiting the Orang Asli Maori communi",
      "content": "KUALA LUMPUR: The government has assured it will continue to empower the Orang Asli community through amendments to the law and new approaches so that they can stand on an equal footing with other races in the country, said Deputy Prime Minister Datuk Seri Dr Ahmad Zahid Hamidi.\nZahid who is also Rural and Regional Development Minister said his experience when visiting the Orang Asli Maori community in Rotorua, New Zealand, provided inspiration on how the rights of the indigenous community there were restored to the point where they were able to control the dairy, plantation and agricultural industries that are exported abroad.\n\"God willing, we will do the same, not only through amendments to the Act (the Orang Asli Act 1954), but also several new approaches so that the standard of living of the Orang Asli community will increase,\" he said when answering in the question-and-answer session at Dewan Negara, today.\nHe was replying to a supplementary question by Senator Manolan Mohamad who wanted to know the government's target to increase Orang Asli staff in the Orang Asli Development Department (JAKOA).\nZahid said positive developments could also be seen when the number of professionals among the Orang Asli increased, including more than 20 doctoral degree holders (PhD), more than five professors, as well as engineers, accountants and various other fields.\n\"This means that there is no marginalisation, on the contrary, in terms of education, we give priority to the Orang Asli and want them to be involved with full commitment,\" he said.\nHe said the government also provided continuous support to Orang Asli students in primary and secondary schools, including transportation facilities, a pocket allowance of RM4 per day and other assistance that could promote social mobility.\n\"With this, the careers they will obtain will enable them to be on par with other races in this country.\n\"I also express my gratitude because the plans and programmes implemented have received support from all parties, including the Orang Asli professionals themselves,\" he said.\nMeanwhile, when replying to Senator Shahrol Wizan Sulong's original question who wanted to know the government's steps to raise employment opportunities for Orang Asli youth in various sectors to strengthen their socio-economic status, Zahid said three main approaches have been formulated to strengthen their participation, namely through the academic, technical education ecosystem and entrepreneurial courses.\n\"These three categories will channel youth to work either in the public sector, GLC, GLIC or the private sector.\n\"The ministry together with other ministries has arranged these channels so that Orang Asli youth can get employment opportunities,\" he said.\nHe added that from 2021 to 2024, a total of 2,913 Orang Asli youths have been placed as community rangers under the Peninsular Forestry Department, while another 37 have been placed in other agencies including HRD Corp, Koperasi Akademik Binaan Malaysia (Kobina) and UOA Akademi since 2023.\n\"In the Malaysia Aviation Group, a total of five Orang Asli youths were accepted as cabin crew last year.\n\"In the private sector, 45 people work at Sony as production operators, 12 security guards at HRD Corp and 20 people at Kobina in 2024,\" he said.\nIn entrepreneurship, Zahid said the involvement of Orang Asli entrepreneurs continued to increase, including through the Rural Entrepreneur Carnival (KUD) programme, where last year alone, 243 Orang Asli entrepreneurs were involved in KUD and the Orang Asli Entrepreneur Carnival (KUOA) with sales of RM839,000.\n\"Mara also, through the Biz Network platform and the Mara Business Digitalisation programme (Digital Biz), implemented e-commerce training to strengthen the competitiveness of Orang Asli entrepreneurs. In fact, under Mara's Gate to Global, several entrepreneurs have been brought to market their products internationally,\" he said.\nIn the context of public services, Zahid said the\ngovernment, through the Public Services Department (JPA), intended to produce more Orang Asli figures to fill senior positions in government departments, including in JAKOA.\nHe also added that the Orang Asli Act 1954 (Act 134), which is already 71 years old, needed to be amended so that the rights of the community were restored.\n\"This is because the rights of the Orang Asli must be restored and educational opportunities must be strengthened.\n\"In 2023, we targeted 400 Orang Asli children to enter university, but managed to achieve 418 people.\n\"Last year, the target was 450 people, the achievement was 456 people.\n\"This year until July, out of the target of 500 people, 150 have been successfully accepted and I am confident that the figure will exceed the target by the end of the year,\" he said. — BERNAMA\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "9f0bdae208d7c5b3",
      "title": "NCPR project: Much-needed relief for Penang's northern coast",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271937/ncpr-project-much-needed-relief-penangs-northern-coast",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:53:25Z",
      "summary": "GEORGE TOWN: The much-anticipated North Coastal Paired Road (NCPR) project promises to be a game-changer for Penang's northern coast, offering residents, commuters and tourists a vital alternative to the single-carriageway Jalan Batu Ferringhi, which has long been a source of gridlock and frustration.\nFor years, the coastal road connecting George Town to Batu Ferringhi and Teluk Bahang has been un",
      "content": "GEORGE TOWN: The much-anticipated North Coastal Paired Road (NCPR) project promises to be a game-changer for Penang's northern coast, offering residents, commuters and tourists a vital alternative to the single-carriageway Jalan Batu Ferringhi, which has long been a source of gridlock and frustration.\nFor years, the coastal road connecting George Town to Batu Ferringhi and Teluk Bahang has been unable to cope with surging traffic, particularly during peak hours, festive seasons and long weekends.\nAs vehicles flood the route, congestion becomes unbearable, leaving commuters stuck in standstill traffic for hours. This problem is compounded when accidents, heavy rain or fallen debris block the road, severely delaying emergency services like ambulances, fire and rescue teams and police.\nIn response to these ongoing issues, the Penang government is forging ahead with the NCPR, which will provide a much-needed alternative, state Infrastructure, Transport and Digital Committee chairman Zairil Khir Johari said.\nThis 10.61km highway, part of the broader three major roads and tunnel project, will consist of 8.41km of at-grade road and a 2.2km coastal viaduct.\nHe said the new route would stretch from Tanjung Bunga to Teluk Bahang, reducing travel time from the current 30 to 45 minutes during peak periods to just seven minutes.\nThe NCPR's construction, scheduled to begin in 2026, is expected to be completed by 2031.\n\"The road will be a critical link for residents and tourists alike, who have been dependent on the increasingly unreliable Jalan Batu Ferringhi.\n\"The new alignment will pass the Masjid Terapung (Floating Mosque) in Tanjung Bunga before extending over the sea and returning to land near Shamrock. From there, it will cut through Batu Ferringhi and terminate in Teluk Bahang.\n\"The NCPR is more than just a road project. This is a much-needed alternative that will not only ease the severe congestion along the existing route but also improve emergency response times and boost safety and accessibility of Penang's northern coastline,\" he said.\nThe project comes with a price tag of RM2.9 billion, which includes RM500 million allocated for land acquisition.\nConstruction is set to begin once final agreements between the Penang government and Consortium Zenith Construction (CZC) are signed.\nCZC is finalising the project's detailed design, with environmental and land acquisition processes expected to take up to 1.5 years.\nOnce land acquisition is completed, work will proceed, with construction slated to start on state-owned land.\nZairil said, in addition to alleviating traffic issues, the NCPR is poised to unlock new socio-economic opportunities for the northern coastal corridor, further boosting Penang's economic growth.\n\"With this major infrastructure investment, we are ensuring that Penang remains a competitive and resilient region, capable of accommodating future growth and development.\n\"Once completed, the NCPR will provide much-needed relief to residents, businesses and visitors, ensuring safer, more efficient travel while promoting long-term economic sustainability in the region,\" he added.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "b3aaaae95af99688",
      "title": "Tuchel wants England to embrace long throw-ins, long balls in World Cup bid",
      "url": "https://www.nst.com.my/sports/football/2025/09/1271935/tuchel-wants-england-embrace-long-throw-ins-long-balls-world-cup-bid",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:52:12Z",
      "summary": "LONDON: England manager Thomas Tuchel has outlined plans to incorporate more long throw-ins and long balls into his side's approach ahead of next year's World Cup.\nEngland made it four wins from four in Group K on Saturday with a 2-0 win over Andorra, but they struggled to break down the world's 174th ranked team at Villa Park in a far-from fluent performance.\nThey took the lead in the first half ",
      "content": "LONDON: England manager Thomas Tuchel has outlined plans to incorporate more long throw-ins and long balls into his side's approach ahead of next year's World Cup.\nEngland made it four wins from four in Group K on Saturday with a 2-0 win over Andorra, but they struggled to break down the world's 174th ranked team at Villa Park in a far-from fluent performance.\nThey took the lead in the first half through an own goal and had to wait until the 67th minute to make it 2-0 through Declan Rice's header.\nTuchel flagged the return of old-school methods when he named his squad last week.\n\"I told you: the long throw-in is back,\" Tuchel, who took over from Gareth Southgate last October, told reporters. \"But we do not have a lot of time.\n\"But once we arrive at the World Cup, all these things matter, so we will also talk about long throw-ins, we will talk about long kicks from the goalkeeper and not only playing short.\n\"But we cannot put everything into four days of training. But these things will matter.\"\nEngland next face Serbia in Belgrade on Tuesday. - Reuters\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "445e4cc5317b6e3b",
      "title": "#SHOWBIZ: Hujan lends voice for Harimau Malaya's anthem 'Demi Lencana Di Dada'",
      "url": "https://www.nst.com.my/lifestyle/groove/2025/09/1271933/showbiz-hujan-lends-voice-harimau-malayas-anthem-demi-lencana-di",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:48:23Z",
      "summary": "KUALA LUMPUR: Harimau Malaya, together with Warner Music Malaysia and the Football Association of Malaysia, has unveiled a special collaboration – the single 'Demi Lencana Di Dada'.\nHarian Metro today reported that the song, performed by the popular local band Hujan, has been chosen as the official anthem for the national football team, aimed at igniting both the fighting spirit of the players and",
      "content": "KUALA LUMPUR: Harimau Malaya, together with Warner Music Malaysia and the Football Association of Malaysia, has unveiled a special collaboration – the single 'Demi Lencana Di Dada'.\nHarian Metro today reported that the song, performed by the popular local band Hujan, has been chosen as the official anthem for the national football team, aimed at igniting both the fighting spirit of the players and the passion of supporters across the country.\nHujan's frontman, Noh Salleh, shared that the production of the single began as early as February this year.\nHe explained that careful planning was required to ensure the music, lyrics, and message carried the right emotional weight.\n\"We were both thrilled and honoured when we were allowed to perform the official song for Harimau Malaya. As Malaysians, football is already part of our collective identity,\" he said.\nAccording to Noh, singing the song is more than just performing another song, as it is about embodying a unifying spirit that brings the nation together behind its beloved team.\n\"When we sing this, it isn't just music. It's about creating an energy that resonates from the stadium to every home, reminding everyone that Harimau Malaya belongs to us all,\" he added.\nThe journey to complete the single was not without challenges. Noh admitted that capturing the true essence of Harimau Malaya – its determination, spirit, and pride – demanded sincerity and attention to detail.\n\"It was not easy to translate that sense of pride and resilience into music. This song represents struggle, sacrifice, and hope. Every lyric and every note had to carry that weight to inspire both players and fans,\" he said.\nBeyond fostering national pride, the song is also envisioned as a driving force for the players. Noh hopes 'Demi Lencana Di Dada' will motivate the team to continue striving for excellence and to raise Malaysia's name on the global football stage.\n\"We truly hope this anthem fuels their determination to succeed. More than achievements, football has the power to unite Malaysians of all races and backgrounds under one flag,\" he added.\nThe official debut of the single took place on Sept 4 at Bukit Jalil National Stadium during the Malaysia vs. Singapore friendly match.\nFans in attendance were the first to experience the anthem in a live stadium atmosphere, making the launch even more meaningful.\nThe anthem will also be played at the upcoming match between Malaysia and Palestine, scheduled for today at Sultan Ibrahim Stadium, Johor.\nProduced jointly by FAM and Warner, 'Demi Lencana Di Dada' marks the first official collaboration of its kind between the two organisations.\nThe single is now available for streaming across all major digital platforms, with a lyric video simultaneously released on Warner Music Malaysia's YouTube channel.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "8f6bd47d63203786",
      "title": "Armed forces await Nadma nod for Afghan quake aid mission",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271931/armed-forces-await-nadma-nod-afghan-quake-aid-mission",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:48:01Z",
      "summary": "KUALA LUMPUR: The armed forces are ready to deploy assistance to Afghanistan to aid victims of the recent earthquake that struck the country.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said they were awaiting a decision by the National Disaster Management Agency (Nadma).\n\"Nadma held a meeting this morning to discuss the matter, and any decision taken will determine the form of Malaysia's as",
      "content": "KUALA LUMPUR: The armed forces are ready to deploy assistance to Afghanistan to aid victims of the recent earthquake that struck the country.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said they were awaiting a decision by the National Disaster Management Agency (Nadma).\n\"Nadma held a meeting this morning to discuss the matter, and any decision taken will determine the form of Malaysia's assistance. The armed forces are prepared if there is a directive for us to send a medical team.\n\"It will depend on suitability and the conditions on the ground. For example, our response in Bangladesh was different, in Turkiye it was different,\" he told reporters at a press conference after visiting the army's Western Field Command Headquarters in Sungai Besi, here.\nYesterday, Deputy Prime Minister Datuk Seri Dr Ahmad Zahid Hamidi said Malaysia was ready to\ndeploy\nits Special Malaysia Disaster Assistance and Rescue Team (SMART) to Afghanistan.\nZahid, who is also the Nadma chairman, said he would also request assistance from the armed forces' medical corps to support the mission.\nIt was\nreporte\nd that a magnitude 6.0 earthquake struck eastern Afghanistan near the Pakistani border on Aug 31, killing at least 800 people and causing widespread damage.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "d63a53c6a63c30a1",
      "title": "#SHOWBIZ: Harry Styles and Zoë Kravitz spark relationship buzz",
      "url": "https://www.nst.com.my/lifestyle/groove/2025/09/1271928/showbiz-harry-styles-and-zo%C3%AB-kravitz-spark-relationship-buzz",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:44:42Z",
      "summary": "NEW YORK CITY: Singer Harry Styles is reportedly in one of the happiest chapters of his life as he embraces a new romance with actress Zoë Kravitz.\nThe 31-year-old former One Direction star was recently spotted strolling arm in arm with Kravitz, 36, in Williamsburg, Brooklyn, where she owns an apartment once shared with her former fiancé, Channing Tatum. Their public outing comes after they were f",
      "content": "NEW YORK CITY: Singer Harry Styles is reportedly in one of the happiest chapters of his life as he embraces a new romance with actress Zoë Kravitz.\nThe 31-year-old former One Direction star was recently spotted strolling arm in arm with Kravitz, 36, in Williamsburg, Brooklyn, where she owns an apartment once shared with her former fiancé, Channing Tatum. Their public outing comes after they were first linked in August, when they were seen walking together in Rome.\nAn insider told 'Page Six': \"It's so hard to date as a celebrity… Harry wouldn't have gone public with Kravitz if it wasn't anything. It's very new and fresh and they're just having fun.\"\nThe source added that Harry prefers not to \"label this stuff,\" but confirmed: \"This is the happiest Harry has ever been, he's just having a great time.\"\nThe relationship comes during a quieter period for Styles, who wrapped up his two-year global tour in Italy in July 2023.\nFriends say he worked tirelessly during the tour and has since shifted to a more low-key lifestyle.\nHe's been seen enjoying cafes near his Hampstead home, running the Tokyo marathon earlier this year, and even blending into crowds — most notably while watching Pope Leo XIV deliver an address at St Peter's Square in May.\nStyles also made an appearance at the Labour Day wedding of Instagram executive Charles Porch and philanthropist Robert Denning in Paris.\nReality star Carole Radziwill shared that the singer gallantly helped her up the steps of Le Bristol hotel, a gesture later echoed by Cassandra Grey of Violet Grey, who likened him to \"Cinderella's prince.\"\nKravitz, daughter of Lenny Kravitz and Lisa Bonet, has had her own share of high-profile relationships.\nShe was married to Karl Glusman before her brief engagement to Channing Tatum ended last October.\nMost recently, she's been busy promoting her new film 'Caught Stealing' alongside co-star Austin Butler.\nAs both Styles and Kravitz balance thriving careers with newfound companionship, fans are watching with fascination to see how this fresh romance unfolds.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "5f814ea48bc330fd",
      "title": "RM281.9mil for public toilets, halls and parks upgrades, says minister",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271926/rm2819mil-public-toilets-halls-and-parks-upgrades-says-minister",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:43:39Z",
      "summary": "KUALA LUMPUR: The Housing and Local Government ministry has approved an allocation of RM281.9 million from 2024 to July 31 this year to upgrade public facilities across the country.\nMinister Nga Kor Ming said that the allocation involved 1,730 projects, including the maintenance and upgrading of public toilets, multi-purpose halls, and recreational facilities.\n\"Through the Department of Local Gove",
      "content": "KUALA LUMPUR: The Housing and Local Government ministry has approved an allocation of RM281.9 million from 2024 to July 31 this year to upgrade public facilities across the country.\nMinister Nga Kor Ming said that the allocation involved 1,730 projects, including the maintenance and upgrading of public toilets, multi-purpose halls, and recreational facilities.\n\"Through the Department of Local Government, the ministry has also provided funding for small-scale projects under the BP.1 Development Project to all 156 local authorities nationwide.\n\"This allocation is based on their applications and is divided into four scopes: infrastructure, public facilities, socioeconomics, and security,\" he said in the Dewan Negara today.\nNga was responding to a question from senator Datuk Mustafa Musa, who inquired about the targets for reform in national public cleansing efforts, particularly in ensuring the upkeep of public parks and recreational facilities.\nHe said the federal government has also appointed three concession companies to manage waste collection and cleansing in states that have adopted the Solid Waste and Public Cleansing Management Act 2007 (Act 672), a mandate that includes public parks.\nAs for the rest of the states, he said the cleaning of public parks remains under the jurisdiction of their respective local authorities.\nMeanwhile, he added that the ministry welcomes the use of new technologies, including artificial intelligence (AI) and drones, to assist in monitoring cleanliness and damage to public facilities.\n\"We are certainly moving in that direction, but it cannot be implemented all at once for every authority, as local authorities are divided into three tiers: city councils, municipal councils, and district councils,\" he said.\nNga was responding to a supplementary question from Senator Datuk Rosni Sohar, who inquired whether AI technology was being used automatically to monitor cleanliness and damage in public parks.  – BERNAMA\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "04a9ef874da25f0c",
      "title": "Snack vendor jailed 7 years for raping 12-year-old stepdaughter",
      "url": "https://www.nst.com.my/news/crime-courts/2025/09/1271921/snack-vendor-jailed-7-years-raping-12-year-old-stepdaughter",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:39:34Z",
      "summary": "MUAR: A snack food vendor was sentenced to seven years' imprisonment and two strokes of the rotan after pleading guilty to raping his sister-in-law's 12-year-old stepdaughter.\nJudge Sayani Mohd Nor sentenced the 32-year-old accused at the Sessions Court here today.\nThe court considered the submissions from both parties before convicting him under Section 376(1) of the Penal Code, which carries a m",
      "content": "MUAR: A snack food vendor was sentenced to seven years' imprisonment and two strokes of the rotan after pleading guilty to raping his sister-in-law's 12-year-old stepdaughter.\nJudge Sayani Mohd Nor sentenced the 32-year-old accused at the Sessions Court here today.\nThe court considered the submissions from both parties before convicting him under Section 376(1) of the Penal Code, which carries a maximum penalty of 20 years' imprisonment and caning if found guilty.\nAccording to the charge, the incident occurred at a house in Batu Pahat at 3am in April 2022.\nPolice launched an investigation after the school principal alerted them on Aug 13, alleging that the student had been raped by her uncle.\nThe prosecution was led by deputy public prosecutor Othman Affan Ismail. The defendant was unrepresented in court.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "ccfd752fa6e35742",
      "title": "European automakers confront tariffs, Chinese rivalry at Munich car show",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271919/european-automakers-confront-tariffs-chinese-rivalry-munich-car",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:39:03Z",
      "summary": "MUNICH: Major automakers will showcase their latest models at Munich's car show on Monday as Europe's automotive sector faces crises ranging from US tariff hikes to costly electrification and the expansion of Chinese automakers on their home turf.\nAside from a product blitz to counter Chinese models being pushed to European consumers, including by BYD, Changan and GAC, domestic firms will focus on",
      "content": "MUNICH: Major automakers will showcase their latest models at Munich's car show on Monday as Europe's automotive sector faces crises ranging from US tariff hikes to costly electrification and the expansion of Chinese automakers on their home turf.\nAside from a product blitz to counter Chinese models being pushed to European consumers, including by BYD, Changan and GAC, domestic firms will focus on lobbying to persuade the European Union to reconsider its 2035 ban on combustion-engine cars.\nAttention will also be on US President Donald Trump's tariffs on European-made cars.\nEven if a US-EU trade deal agreed in July goes ahead, European automakers would face a 15 per cent tariff that could force them not to sell less profitable models in the US.\nEuropean automakers at the IAA Mobility show in Munich, running from September 9-12, also face sinking sales in China, the biggest single market for Volkswagen, BMW and Mercedes-Benz.\nMeanwhile, auto executives and lobby groups are pushing hard for the EU's fossil-fuel car ban, which is up for review by the end of 2025, to be scrapped or changed.\nBMW CEO Oliver Zipse called the ban a \"big mistake\" on Friday, seeking emissions regulations instead, that capture a vehicle's entire supply chain.\nDanijel Visevic, managing partner at climate tech-focused venture capital firm World Fund, said such lobbying by European automakers was \"stupid\" and that \"they should put their energy into building the best, cheapest cars to out-compete the Chinese.\"\nChina remains the biggest challenge for Europe's auto industry. According to consultancy AlixPartners, as recently as 2020, global automakers had a 62 per cent market share in China, which shrank to 46 per cent in 2023 and could drop to 28 per cent by 2030.\nPorsche has felt that pain acutely after seeing its Chinese sales fall 28 per cent in the first half, and will suffer the ignominy of dropping out of Germany's benchmark blue-chip index on September 22 - almost three years to the day since its landmark initial public offering.\nThat will further raise pressure on Oliver Blume, CEO of Porsche parent Volkswagen, to drop his unpopular dual role as Porsche's CEO.\nChinese automakers also pose a problem for the likes of Volkswagen in Europe.\nAccording to JATO Dynamics, Chinese brands almost doubled their European market share to 4.8 per cent through July this year versus the same period in 2024.\nAnd consultants McKinsey estimate that within a decade, Chinese automakers could command a share equal to what Japanese and Korean automakers enjoy now, of 14 per cent and 9 per cent, respectively.\nPhil Dunne, a managing director at consultancy Stax, said Europe's automakers have moved too late to counter this threat after years of complacency, and now, \"the Chinese are here to stay.\"\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "6b69f1fad0d1dd37",
      "title": "Gobind: Malaysia to draft new law for driverless cars",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271915/gobind-malaysia-draft-new-law-driverless-cars",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:30:34Z",
      "summary": "CYBERJAYA: The Digital Ministry is currently holding discussions with the Transport Ministry to draft and introduce a new law on autonomous vehicles (AVs).\nThis follows the growing use of such driverless vehicles in several countries, necessitating new legislation as Malaysia prepares for future technology.\nDigital Minister Gobind Singh Deo said the discussions with the Transport Ministry focused ",
      "content": "CYBERJAYA: The Digital Ministry is currently holding discussions with the Transport Ministry to draft and introduce a new law on autonomous vehicles (AVs).\nThis follows the growing use of such driverless vehicles in several countries, necessitating new legislation as Malaysia prepares for future technology.\nDigital Minister Gobind Singh Deo said the discussions with the Transport Ministry focused on the use of autonomous vehicles.\nHe said the new law would, among other things, look at safety aspects and compliance with existing standards.\n\"I have started discussions on what we call the 'autonomous vehicle network'.\n\"Moving forward, we can see in other countries vehicles operating without drivers — so it's autonomous.\n\"In this situation, we have to see how we can develop a legal system that ensures the system is safe because it involves public safety.\n\"If we want to use driverless cars, we must ensure the standards and safety aspects are refined and that we have a legal framework emphasising these aspects,\" he told reporters after launching the country's first Vehicle Forensics Laboratory at the Cyber Axis Tower in Cyberjaya today.\nLast year, it was reported that the government would draft new laws to regulate autonomous vehicles on the roads in line with technological advances, especially in the public transport sector.\nTransport Minister Anthony Loke was quoted as saying the policy is crucial to ensure the safety and effectiveness of autonomous vehicles before commercialisation, as Malaysia currently has no laws covering their operation.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "bbbfa4edb4a1ade7",
      "title": "Amir Hamzah: Govt finalising RON95 subsidy eligibility",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271913/amir-hamzah-govt-finalising-ron95-subsidy-eligibility",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:22:14Z",
      "summary": "KUALA LUMPUR: The government is in the final stage of concluding eligibility criteria and implementation methods for RON95 fuel subsidies with stakeholders, Finance Minister II Datuk Seri Amir Hamzah Azizan said.\nHe said the subsidy targeting mechanism would be carefully designed to ensure the majority of eligible citizens are not affected.\n\"The government is also working with petrol station opera",
      "content": "KUALA LUMPUR: The government is in the final stage of concluding eligibility criteria and implementation methods for RON95 fuel subsidies with stakeholders, Finance Minister II Datuk Seri Amir Hamzah Azizan said.\nHe said the subsidy targeting mechanism would be carefully designed to ensure the majority of eligible citizens are not affected.\n\"The government is also working with petrol station operators to ensure the MyKad payment system can be used at pumps once the RON95 subsidy is rolled out at the end of this month,\" he told the Senate during question time on Monday.\nHe was responding to a supplementary question from Senator Rose Suryati Alang on the latest approach to fuel subsidies and the smoothness of implementation.\nAmir Hamzah, who is also serving as the Economy Minister, stated that the government would utilise the data from the Central Database Hub (Padu) system to determine eligibility, ensuring that only those truly qualified would benefit.\n\"We will announce and implement this at the end of the month with assurance that eligible citizens will receive the subsidies as intended,\" he added. — BERNAMA\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "24dfa8e84dddaa75",
      "title": "Redirect sugar subsidy to fund doctors allowances, says think tank",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271911/redirect-sugar-subsidy-fund-doctors-allowances-says-think-tank",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:21:04Z",
      "summary": "KUALA LUMPUR: The government should scrap the RM500 million sugar subsidy and redirect the funds to increase doctors' on-call allowances (ETAP), the Galen Centre for Health and Social Policy, a policy research and advocacy group, said.\nWith Budget 2026 due to be tabled next month, its chief executive Azrul Mohd Khalib said that at least RM80 million should be set aside to resolve the long-overdue ",
      "content": "KUALA LUMPUR: The government should scrap the RM500 million sugar subsidy and redirect the funds to increase doctors' on-call allowances (ETAP), the Galen Centre for Health and Social Policy, a policy research and advocacy group, said.\nWith Budget 2026 due to be tabled next month, its chief executive Azrul Mohd Khalib said that at least RM80 million should be set aside to resolve the long-overdue pay adjustment for government medical officers and specialists.\n\"The current ETAP rates at RM220 for medical officers and RM250 for specialists per weekend shift, translate to less than RM10 per hour.\n\"According to Health Ministry officials during a Parliamentary Select Committee on Health session held in February, raising ETAP allowances by RM55 to RM65 per shift across the board would cost approximately RM75 million to RM80 million,\" Azrul said in a press statement today.\nMalaysia remains one of the few countries still subsidising sugar, despite the alarming rise in non-communicable diseases, he said.\nAzrul also said that the subsidy had artificially lowered sugar prices, contradicting the government's pledge to curb excessive sugar consumption.\n\"Each year, the Malaysian government gives around RM500 million to sugar manufacturers as subsidies or incentives, or around RM42 million per month.\n\"This translates to RM1.00 per kilogramme of sugar for raw sugar and refined sugar,\" he said.\nAzrul said that removing or rationalising the subsidies would free up at least RM500 million without burdening the nation's finances.\n\"There is more than enough to provide the RM80 million needed to raise allowances,\" he added.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "c7465c4c028b5046",
      "title": "#SHOWBIZ: 'Running Man' star Kim Jong-kook ties the knot",
      "url": "https://www.nst.com.my/lifestyle/groove/2025/09/1271909/showbiz-running-man-star-kim-jong-kook-ties-knot",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:18:28Z",
      "summary": "SEOUL: South Korean singer and television personality Kim Jong-kook has wed his non-celebrity girlfriend in a private ceremony, according to Korean media reports.\nThe wedding, a low-key affair, was held on Friday in Seoul, with only close family and friends in attendance.\nThe beloved star and former frontman of the band Turbo, aged 49, announced his impending nuptials on Aug 18 through a heartfelt",
      "content": "SEOUL: South Korean singer and television personality Kim Jong-kook has wed his non-celebrity girlfriend in a private ceremony, according to Korean media reports.\nThe wedding, a low-key affair, was held on Friday in Seoul, with only close family and friends in attendance.\nThe beloved star and former frontman of the band Turbo, aged 49, announced his impending nuptials on Aug 18 through a heartfelt, handwritten letter to fans on his fan cafe.\n\"I've always prepared myself that one day I'd be able to write something like this and post it myself, but as I prepare to do it, I find myself nervous and trembling more than I ever imagined,\" he wrote.\nHe ended his letter by asking for his fans' support.\n\"Please congratulate me and support me. It's a bit late, but how fortunate I am to be going on this path, right?\"\nKnown for his witty persona on the hit variety show Running Man, it was revealed that Kim shared the good news with his co-stars just ten minutes before filming began for an episode broadcast on Aug 31.\nHis longtime friend and fellow cast member, Yoo Jae-suk, 53, reportedly served as the emcee at the wedding, telling him that despite a busy schedule, he \"will make it work\" for his friend.\nThe newlywed couple is believed to have moved into a new home in Nonhyeon-dong, Gangnam, which Kim reportedly purchased for six billion won (RM18.2 million).\nIn addition to his new chapter in life, the singer is also preparing for a significant milestone in his career—a commemorative album and concert slated for October 2025 to celebrate his 30th debut anniversary.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "b4561a25a94794c6",
      "title": "EPF refocuses on rebuilding members' savings after RM145bil Covid withdrawals",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271907/epf-refocuses-rebuilding-members-savings-after-rm145bil-covid",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:15:56Z",
      "summary": "KUALA LUMPUR: The Employees Provident Fund (EPF) is working to rebuild contributors' savings after RM145 billion was withdrawn through four Covid-19 related withdrawal facilities, said Finance Minister II Datuk Seri Amir Hamzah Azizan.\nHe said the withdrawals involved 8.2 million contributors through i-Lestari, i-Sinar, i-Citra and special withdrawals.\n\"Therefore, the focus is now on strengthening",
      "content": "KUALA LUMPUR: The Employees Provident Fund (EPF) is working to rebuild contributors' savings after RM145 billion was withdrawn through four Covid-19 related withdrawal facilities, said Finance Minister II Datuk Seri Amir Hamzah Azizan.\nHe said the withdrawals involved 8.2 million contributors through i-Lestari, i-Sinar, i-Citra and special withdrawals.\n\"Therefore, the focus is now on strengthening retirement savings and ensuring members enjoy sustainable retirement income,\" he said during a question and answer session at the Dewan Negara today in reply to a question from Senator Mohd Hasbi Muda who wanted to know whether contributors had sufficient savings to meet their retirement age.\nAmir Hamzah also said the government does not intend to introduce new withdrawals since the EPF account structure has been revamped by creating Account 1, Account 2 and Account 3, where Account 3 is flexible for withdrawals during emergencies.\nHe said the EPF is also looking into a proposal to introduce a monthly pension payment scheme for new members, which is expected to be approved in the next few years, while existing contributors can choose to switch to the scheme.\n– BERNAMA\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "0d957794b0061823",
      "title": "FBM KLCI firmer at midday, broader market remains positive",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271905/fbm-klci-firmer-midday-broader-market-remains-positive",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:11:40Z",
      "summary": "KUALA LUMPUR: Bursa Malaysia's benchmark index rose 0.54 per cent at lunch break, while the broader market also remained in positive territory as investors chased regional peers after a quiet week, focusing on selected counters.\nAt 12.30 pm, the FTSE Bursa Malaysia KLCI (FBM KLCI) rose 8.57 points to 1,586.72 from last Thursday's close of 1,578.15.\nThe index began the session 3.07 points firmer at",
      "content": "KUALA LUMPUR: Bursa Malaysia's benchmark index rose 0.54 per cent at lunch break, while the broader market also remained in positive territory as investors chased regional peers after a quiet week, focusing on selected counters.\nAt 12.30 pm, the FTSE Bursa Malaysia KLCI (FBM KLCI) rose 8.57 points to 1,586.72 from last Thursday's close of 1,578.15.\nThe index began the session 3.07 points firmer at 1,581.22, and was traded between 1,579.57 and 1,587.10 during the morning session.\nThe optimism in the broader market saw gainers ahead of losers 463 to 399, while 472 counters were unchanged, with 1,234 untraded and eight suspended.\nTurnover stood at 1.15 billion units worth RM815 million.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "d0a3010234f634e4",
      "title": "[UPDATED] Malaysia's Unifil deployment to end after mandate expires in 2026",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271902/updated-malaysias-unifil-deployment-end-after-mandate-expires-2026",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T13:05:48Z",
      "summary": "KUALA LUMPUR: Malaysia's deployment under the United Nations Interim Force in Lebanon (Unifil) will end when the UN Security Council (UNSC) mandate expires in 2026.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said the UNSC, in the final week of August, extended Unifil's mandate for one more year.\n\"This means we will send one final team next year. After that, Malaysia will no longer have a Un",
      "content": "KUALA LUMPUR: Malaysia's deployment under the United Nations Interim Force in Lebanon (Unifil) will end when the UN Security Council (UNSC) mandate expires in 2026.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said the UNSC, in the final week of August, extended Unifil's mandate for one more year.\n\"This means we will send one final team next year. After that, Malaysia will no longer have a Unifil presence in Lebanon. We will then proceed with their redeployment and related arrangements,\" he told reporters after visiting the army's Western Field Command Headquarters in Sungai Besi here.\nThe UNSC renewed Unifil's mandate on Aug 28, 2025, extending it until Dec 31, 2026, and initiating an orderly drawdown of the mission throughout 2027. (https://www.nst.com.my/amp/world/world/2025/08/1267343/un-security-council-extends-lebanon-peacekeeping-mission-one-last-time)\nMalaysia deploys its peacekeepers in Lebanon through the Malaysian Battalion (Malbatt), which has served with Unifil since 2007. The contingent was established at the UN's request and has maintained a continuous presence in southern Lebanon.\nFounded in 1978 to oversee Israel's withdrawal after its invasion of southern Lebanon, Unifil now fields over 10,000 peacekeepers from 47 countries, with the largest contributions from Indonesia and Italy. Its operations cover 1,060 square kilometres in the south, with 50 positions along Lebanese territory.\nBased at Camp Marakah near Tyre, Malbatt deploys about 850 personnel per rotation, including infantry, engineers, medics, and support units equipped with armoured vehicles and other assets.\nTheir core duties include patrolling and monitoring the Blue Line — the UN-demarcated border between Lebanon and Israel — and supporting the Lebanese Armed Forces in maintaining security.\nMalbatt also participates in humanitarian and community activities.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "d679c29211ba6141",
      "title": "Zara's book had handwriting of another individual, inquest told",
      "url": "https://www.nst.com.my/news/crime-courts/2025/09/1271900/zaras-book-had-handwriting-another-individual-inquest-told",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:59:26Z",
      "summary": "KOTA KINABALU: A document examiner from the Chemistry Department of Malaysia, Nurul Atiqah Mohd Noh, discovered handwriting belonging to another person in a book owned by the late Zara Qairina Mahathir.\nReading her written testimony at the Coroner's Court here today, Nurul Atiqah said the handwriting was found in a book marked 'W3' on several pages.\n\"The disputed handwriting in 'W3' on pages 2, 7 ",
      "content": "KOTA KINABALU: A document examiner from the Chemistry Department of Malaysia, Nurul Atiqah Mohd Noh, discovered handwriting belonging to another person in a book owned by the late Zara Qairina Mahathir.\nReading her written testimony at the Coroner's Court here today, Nurul Atiqah said the handwriting was found in a book marked 'W3' on several pages.\n\"The disputed handwriting in 'W3' on pages 2, 7 to 14, 25 to 37, 46, 58 to 64, and 73 to 89 shows significant differences in handwriting characteristics compared with the specimen handwriting 'SA' (Zara Qairina's handwriting).\n\"Therefore, I conclude that the disputed handwriting was not written by the specimen writer (Zara Qairina). The disputed handwriting on page one of 'W3' is a mixture of the specimen writer's handwriting (Zara Qairina) and another person's,\" she said.\nThe book marked W3, she said, was a 'Diamonds' notebook, numbered from page one to 103, dated between Nov 16, 2024, and May 24, 2025, containing disputed handwriting or handwriting believed to belong to Zara Qairina.\nIn total, Nurul Atiqah examined 15 sheets of paper, four notebooks, and two textbooks containing handwriting to determine whether they belonged to the late Zara Qairina.\nShe added that all other documents she examined only contained Zara Qairina's handwriting, as the examination showed significant similarities with her specimen handwriting. These documents included sheets of paper marked Y1 to Y7 and Y9 to Y15, as well as Y8, and books marked W1 and W2.\n\"The disputed handwriting in 'Y1' to 'Y7' and 'Y9' to 'Y15' shows sufficient significant similarities in handwriting characteristics with specimen handwriting 'SA'. Therefore, I conclude the disputed handwriting was written by the specimen writer (Zara Qairina).\n\"The disputed handwriting in 'Y8' shows sufficient significant similarities in handwriting characteristics with specimen handwriting 'SA'. Therefore, I conclude it was written by the specimen writer.\n\"The disputed handwriting in 'W1' and 'W2' also shows sufficient significant similarities in handwriting characteristics with specimen handwriting 'SA'. Therefore, I conclude it was written by the specimen writer,\" she said.\nAfter completing the analysis, she said all the documents were placed back into their original case bags and resealed with the Chemistry Department of Malaysia's security label.\nNurul Atiqah said the documents, along with three copies of the chemistry report, were then handed over to the police at 10.45am on Sept 2.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "69b7fcdf74a2e3cd",
      "title": "China office developers offer sweeteners, lower rents to lure tenants",
      "url": "https://www.nst.com.my/property/2025/09/1271898/china-office-developers-offer-sweeteners-lower-rents-lure-tenants",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:57:46Z",
      "summary": "HONG KONG: Chinese commercial property developers are seeking to lure tenants with value-added services such as subsidies for charging electric vehicles in addition to lower rents, as they battle record-high vacancy rates across the country.\nEmpty offices are increasingly common even in top cities such as the southern tech hub of Shenzhen and commercial capital Shanghai, as the sector grapples wit",
      "content": "HONG KONG: Chinese commercial property developers are seeking to lure tenants with value-added services such as subsidies for charging electric vehicles in addition to lower rents, as they battle record-high vacancy rates across the country.\nEmpty offices are increasingly common even in top cities such as the southern tech hub of Shenzhen and commercial capital Shanghai, as the sector grapples with sluggish demand due to corporate cost-cutting and multinational companies shrinking their presence.\nShenzhen reported the highest vacancy rate of 30.6 per cent among the country's four first-tier cities at end-June, according to real estate consultancy Savills, followed by 23.7 per cent in Shanghai, 22.6 per cent in Guangzhou and 19.6 per cent in Beijing, even though working from home is far less common than in many Western markets.\n\"We expect conditions to remain challenging in the near term, with landlords relying on incentives and flexible lease structures to retain tenants,\" said Savills Research senior director James MacDonald, citing continued new supply and softer occupier demand in those cities.\nRents for grade-A offices in the four cities have dropped around 20 per cent to 40 per cent since 2020, with those in Beijing declining the most, according to Savills data.\nThe world's second-largest economy has so far avoided a sharp slowdown in part due to policy support, but markets are braced for weaker growth in the second half amid slowing exports, weak consumer confidence and a persistent property market downturn.\nState-owned China Merchants Commercial REIT, which reported a 16 per cent drop in net property income in the first half, said in an earnings webcast in late August that it was providing tenants with more flexible leases and operational services in order to raise their \"stickiness.\"\n\"These services are as refined as air-con, electric appliances, including electricity fees for charging EV cars,\" said Liu Zhongliu, who oversees management of some of the company's property assets.\nThe company said the commercial real estate sector's condition was more \"severe\" compared to the overall economy, and it would take time for the market to recover as it was under pressure from a \"structural adjustment\" due to insufficient demand and oversupply.\n\"The market had gone through 30 to 40 years of fast growth. Now it will still need more correction; the policies will not reach their goal in one step,\" said China Merchants Commercial REIT executive director Guo Jin.\nMARKET SUPPORT\nTo support the office market, some local authorities have introduced measures including rental subsidies, encouraging older office buildings to be repurposed into residential housing and halted new land sales for commercial development.\nSavills' MacDonald said the most effective role for government would be to support the broader economy rather than attempt to directly stimulate the office market.\nIn the face of fierce competition, developers are offering rental concessions to keep leasing rates up.\nHong Kong developer Hang Lung Properties, whose China office rental revenue dropped 5 per cent in the first half from a year ago, said its assets in Shanghai faced the worst pressure because there was ample supply and rents had dropped.\n\"If you want to retain tenants, you have to cut rents,\" said CEO Weber Lo, who noted that few multinational corporations were expanding in China and many were scouring for cheaper rents.\nOutside the office sector, state-owned logistics warehouse developer Shenzhen International, which counts Chinese e-commerce giant JD.Com and USretailer Walmart as clients, is facing a similar issue.\n\"Our CEO Liu Zhengyu has been working very hard and visiting tenants every other week to maintain a good relationship and retain them,\" Chairman Li Haitao told an earnings conference last month.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "156f62757d862038",
      "title": "Kristian shatters another national record in Rotterdam",
      "url": "https://www.nst.com.my/sports/others/2025/09/1271896/kristian-shatters-another-national-record-rotterdam",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:48:04Z",
      "summary": "KUALA LUMPUR: Long-distance runner Kristian Tung broke another national record, this time in the 10km road race at the Rotterdam Big Series 10 on Saturday.\nThe 21-year-old from the Federal Territories clocked 30 minutes 07 seconds, erasing the mark of 31:01s set by Sanjay Manimaran at the Songkhla Marathon in Thailand last month.\nLast month, Kristian smashed the 40-year-old 3,000m national record ",
      "content": "KUALA LUMPUR: Long-distance runner Kristian Tung broke another national record, this time in the 10km road race at the Rotterdam Big Series 10 on Saturday.\nThe 21-year-old from the Federal Territories clocked 30 minutes 07 seconds, erasing the mark of 31:01s set by Sanjay Manimaran at the Songkhla Marathon in Thailand last month.\nLast month, Kristian smashed the 40-year-old 3,000m national record with a time of 8:15.81s at the British Milers Club meet in the United Kingdom. The previous record was 8:27.00s held by S. Muthiah.\nKristian, who trains under his father, bagged three gold medals at last year's Sarawak Malaysia Games. He is based in the United Kingdom, where he is pursuing a degree in Sports Science and Mathematics at Loughborough University.\nMalaysian Athletics Federation president Datuk Karim Ibrahim said: \"Kristian's time is among the fastest ever recorded by a Malaysian, but for it to be recognised as a national record, we must first obtain the official documents from the organisers.\n\"So far, the result has already been listed by World Athletics, which shows that his preparations for the Thailand SEA Games are on track.\n\"With consistent training in the UK, we believe Kristian can spring a surprise at the SEA Games,\" he added.\nKarim is optimistic that Kristian could also deliver a medal in the 10,000m event at the SEA Games from Dec 9-20.\n\"If he can maintain his current form, he has a medal chance. We cannot say for certain what colour it will be, especially with the strong challenge expected from Thai runners, but Kristian is clearly on the right path,\" added Karim.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "a8c031f40b3f607a",
      "title": "Religious raid exposes five-year cohabitation with 2 children",
      "url": "https://www.nst.com.my/news/crime-courts/2025/09/1271894/religious-raid-exposes-five-year-cohabitation-2-children",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:39:04Z",
      "summary": "KLUANG: A five-year relationship that produced 2 children ended abruptly when Johor Islamic Religious Department (JAINJ) officers raided a rented home here at midnight yesterday.\nActing on a public tip-off, enforcement officers found a man and a divorcee, both in their 30s, living as husband and wife along with two children born out of wedlock.\nThe department said the woman had previously married ",
      "content": "KLUANG: A five-year relationship that produced 2 children ended abruptly when Johor Islamic Religious Department (JAINJ) officers raided a rented home here at midnight yesterday.\nActing on a public tip-off, enforcement officers found a man and a divorcee, both in their 30s, living as husband and wife along with two children born out of wedlock.\nThe department said the woman had previously married abroad but was later left by her former husband.\nThe couple will be charged for close proximity under Section 23 of the Johor Syariah Criminal Offences Enactment 1997, which carries penalties of up to RM5,000 fine, three years' jail, whipping, or all three.\nIn a separate noon raid, JAINJ officers caught a 50-something widower and a divorcee in a house after the man claimed he was there to \"fix a broken pipe.\"\nHis story collapsed when officers found the washing machine in use and the spanners he displayed unsuitable for plumbing.\nThe pair would face charges under Section 27 of the same law, which provides for a RM3,000 fine, two years' jail, or both, if convicted.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "977400b74c3afb0f",
      "title": "Woman loses RM500 in mosque theft",
      "url": "https://www.nst.com.my/news/crime-courts/2025/09/1271892/woman-loses-rm500-mosque-theft",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:22:26Z",
      "summary": "KOTA TINGGI: A woman lost RM500 after her bag was stolen inside Masjid Jamek As-Sharif, in Felda Pasir Raja here on Sept 6.\nDistrict police chief Superintendent Yusof Othman said the theft, which occurred at about 9.19pm on Saturday, was captured on the mosque's closed-circuit television.\nThe victim lodged a police report later that night.\n\"Investigation under Section 380 of the Penal Code for the",
      "content": "KOTA TINGGI: A woman lost RM500 after her bag was stolen inside Masjid Jamek As-Sharif, in Felda Pasir Raja here on Sept 6.\nDistrict police chief Superintendent Yusof Othman said the theft, which occurred at about 9.19pm on Saturday, was captured on the mosque's closed-circuit television.\nThe victim lodged a police report later that night.\n\"Investigation under Section 380 of the Penal Code for theft in a building is ongoing.\n\"The offence carries a jail term of up to 10 years, a fine, or whipping for repeat offenders,\" Yusof said in a statement today.\nHe urged those with information to contact investigation officer Sergeant Wan Mohd Kamal Wan Abas at 013-2624774, or the district police hotline at 07-8831222.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "d83896b2352997d4",
      "title": "Nine remanded over murder probe linked to body found in car, cop shooting",
      "url": "https://www.nst.com.my/news/crime-courts/2025/09/1271891/nine-remanded-over-murder-probe-linked-body-found-car-cop-shooting",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:22:25Z",
      "summary": "IPOH: Nine people, including a woman, have been remanded for seven days to assist in investigations into the case of a woman's body found in a car with a suspect who stabbed and shot a policeman.\nThe remand order, effective today until next Sunday, was issued by magistrate Anis Hanini Abdullah when the suspects were brought to the magistrate's court here this morning.\nThe application for remand wa",
      "content": "IPOH: Nine people, including a woman, have been remanded for seven days to assist in investigations into the case of a woman's body found in a car with a suspect who stabbed and shot a policeman.\nThe remand order, effective today until next Sunday, was issued by magistrate Anis Hanini Abdullah when the suspects were brought to the magistrate's court here this morning.\nThe application for remand was made to facilitate investigations under Section 302 of the Penal Code for murder and Section 307 for attempted murder.\nThe female suspect is being remanded under Section 302, while the other eight male suspects are being remanded under Section 307 of the same code.\nThe nine, aged between their 20s and 60s, were seen entering the chamber at 10.30am before being escorted out in handcuffs by policemen about half an hour later.\nIt was reported that the police arrested them yesterday.\nPerak police chief Datuk Noor Hisam Nordin said the suspects include family members of the main suspect.\nThe incident unfolded at about 1.15am when a patrol unit from the Simpang Pulai police station spotted a suspicious-looking man in a multi-purpose vehicle (MPV) during a crime prevention operation in Taman Desa Pakatan.\nThe suspect fled when approached, prompting a high-speed chase that ended near an oil palm plantation.\nDuring the arrest attempt, a struggle broke out between the suspect and one of the policemen.\nThe suspect managed to seize the officer's service pistol and fired a shot, hitting the 26-year-old corporal in the abdomen. He also stabbed the officer before fleeing with the firearm.\nThe suspect is still at large.\nThe policeman is in\nstable condition\nand receiving treatment at Raja Permaisuri Bainun Hospital.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "a0992e8517c840f5",
      "title": "Trump warns foreign companies after S.Korean workers detained",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271887/trump-warns-foreign-companies-after-skorean-workers-detained",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:19:07Z",
      "summary": "WASHINGTON: President Donald Trump on Sunday warned foreign companies to obey US law after immigration officials arrested some 475 individuals including South Korean workers at a Hyundai-LG battery plant being built in the southern state of Georgia.\nThe arrests were made in a raid by US authorities on Thursday during the largest single-site operation implemented so far under Trump's nationwide ant",
      "content": "WASHINGTON: President Donald Trump on Sunday warned foreign companies to obey US law after immigration officials arrested some 475 individuals including South Korean workers at a Hyundai-LG battery plant being built in the southern state of Georgia.\nThe arrests were made in a raid by US authorities on Thursday during the largest single-site operation implemented so far under Trump's nationwide anti-migrant drive.\n\"Please respect our Nation's Immigration Laws,\" the president posted on social media Sunday.\n\"Your Investments are welcome, and we encourage you to LEGALLY bring your very smart people... What we ask in return is that you hire and train American Workers.\"\nFootage of the raid showed detained workers, in handcuffs and with chains around their ankles, being loaded onto a bus.\nSteven Schrank, special agent in charge of Homeland Security Investigations in Georgia, told reporters that the raid targeted \"unlawful employment practices going on at this massive, 100-acre construction site.\"\nLG Energy Solution has said 47 of its employees were arrested -- 46 South Koreans and one Indonesian.\nThe company has also said about 250 of those arrested were believed to be employed by its contractor, and most of them were South Koreans.\nIn addition to being a key security ally on the Pacific Rim, South Korea is Asia's fourth-biggest economy and a key automaker and electronics producer with multiple plants in the United States.\nSeoul has heeded Trump's repeated call for global investment in US businesses during his tariff negotiations with countries around the world.\nLast month, hours after South Korean President Lee Jae-myung met with Trump in Washington, Korean Air announced it would purchase 100 Boeing aircraft, inking the largest deal in South Korea's aviation history. Seoul also pledged $350 billion in US investment in July.\nAnd South Korea secured an agreement for a 15 percent tariff for exports to the United States -- significantly below the 25 percent that Trump had earlier threatened to introduce.\n- Migrant crackdown -\nDomestically, Trump has promised to revive the US manufacturing sector while also vowing to deport millions of undocumented migrants.\nWhile admonishing investors on Sunday to abide by the law, Trump appeared to acknowledge a skill deficiency in the domestic workforce.\n\"ICE was doing right because they were here illegally,\" he said of the raid by Immigration and Customs Enforcement that has strained relations with South Korea.\n\"But we do have to work something out where we bring in extras so that our people can be trained so that they can do it themselves.\"\nSeoul said Sunday that negotiations to secure the release of the detained workers had been concluded and they would soon be freed and flown home.\n\"The immediate priority now is the swift release of both our LG Energy Solution employees and those of our partner firms,\" company executive Kim Ki-soo told reporters before boarding a plane to Georgia earlier in the day.\nHyundai has said none of those arrested are its employees.\nWith hundreds detained, the size of the Georgia raid is a departure from operations elsewhere.\nIn Los Angeles, immigration agents have repeatedly raided small businesses, targeting hardware stores, restaurants, car washes and street vendors.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "627b54331117b53f",
      "title": "Empowering Malaysia through social entrepreneurship",
      "url": "https://www.nst.com.my/opinion/columnists/2025/09/1271885/empowering-malaysia-through-social-entrepreneurship",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:15:32Z",
      "summary": "SOCIAL entrepreneurs represent a new generation of changemakers who combine business principles with a mission to address pressing social, environmental and economic challenges.\nIn any developing society, government policies and private markets often fall short of fully meeting the needs of marginalised groups, especially in rural areas, informal sectors and underserved communities.\nSocial enterpr",
      "content": "SOCIAL entrepreneurs represent a new generation of changemakers who combine business principles with a mission to address pressing social, environmental and economic challenges.\nIn any developing society, government policies and private markets often fall short of fully meeting the needs of marginalised groups, especially in rural areas, informal sectors and underserved communities.\nSocial enterprises fill these gaps by creating innovative and targeted solutions whereby neither the state nor the market can function effectively.\nTake, for instance, Grub Cycle, a Malaysian startup that reduces food waste by selling surplus groceries at discounted prices.\nOr EPIC Homes, which mobilises volunteers and donors to build safe housing for underprivileged communities.\nThese are not merely businesses — they are movements that uplift lives while promoting environmental sustainability and social equity.\nThese enterprises create value from the ground up, building solutions informed by lived experiences, local knowledge and trust within communities.\nIt is noteworthy that social entrepreneurship should not be seen as a replacement for government welfare programmes or targeted subsidies, such as the PADU system or Sumbangan Tunai Rahmah.\nConversely, these grassroots efforts should be understood as complementary yet agile and localised innovations that can support and amplify the impact of national initiatives.\nA social enterprise can provide job training, digital skills or mental health support to help individuals achieve long-term self-sufficiency.\nIn this way, government aid can meet immediate needs, while social entrepreneurship can sustain lasting transformation.\nThis blended model — where government and social innovators collaborate — reflects the Malaysia Madani spirit, embracing compassion, sustainability and mutual responsibility.\nMalaysia is blessed with a young, digitally savvy and increasingly socially conscious population.\nMany young Malaysians are not only job seekers but purpose seekers, who are eager to contribute to society in meaningful ways.\nSocial entrepreneurship offers them a platform to innovate, experiment and drive change without waiting for bureaucracy to catch up.\nSimilar initiatives that were freshly launched by the former economy minister are one of the remarkable initiatives.\nTo unlock this potential, we need supportive ecosystems. This includes access to seed funding, mentorship, business development training and regulatory clarity.\nUniversities, non-governmental organisations and CSR programmes must play a stronger role in nurturing young social innovators, integrating social impact modules into business education while offering real-world experiential learning opportunities.\nA national initiative akin to \"Dana Inovasi Sosial Madani\" could be explored — a fund that invests in promising social ventures, especially in B40 and rural communities.\nBy creating enabling conditions, we move from celebrating isolated success stories to mainstreaming social entrepreneurship as a national development strategy.\nMalaysia can also learn from our neighbours who have made headway in supporting social entrepreneurship.\nThailand's Social Enterprise Promotion Act provides legal recognition and tax incentives for accredited social enterprises.\nIn the Philippines, the Pondo sa Pagbabago at Pag-asenso (P3) fund helps micro-enterprises scale up with low-interest financing and training.\nAdditionally, Singapore has integrated social entrepreneurship into its broader Smart Nation agenda, with the Singapore Centre for Social Enterprise initiative supporting social enterprises through capacity building and market access.\nThese efforts offer valuable insights into how governments can co-create solutions with civic entrepreneurs.\nDR HASROLEFFENDY HASSAN\nFaculty of Business and Management,\nUiTM, Kedah\n*The views expressed in this article are the author's own and do not necessarily reflect those of the New Straits Times\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "9d8e299311261992",
      "title": "Over 58,000 inmates freed under licensed prisoners initiative nationwide since 2020",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271884/over-58000-inmates-freed-under-licensed-prisoners-initiative-nationwide",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:15:31Z",
      "summary": "BENTONG: A total of 58,867 inmates have been released through the Licensed Release of Prisoners Programme (PBSL) since 2020.\nPrisons Department deputy commissioner-general (Community) Ahmad Faudzi Awang said 60,914 inmates were initially proposed for PBSL nationwide before going through the screening process.\nHe said the PBSL programme is carried out annually and involves prisoners convicted of va",
      "content": "BENTONG: A total of 58,867 inmates have been released through the Licensed Release of Prisoners Programme (PBSL) since 2020.\nPrisons Department deputy commissioner-general (Community) Ahmad Faudzi Awang said 60,914 inmates were initially proposed for PBSL nationwide before going through the screening process.\nHe said the PBSL programme is carried out annually and involves prisoners convicted of various offences, including drug abuse, theft, robbery, armed robbery and failure to pay fines.\n\"The initiative allows for the release of inmates from vulnerable groups and pregnant women who meet the required conditions, after being considered and approved by the PBSL Committee.\n\"The department has introduced community-based rehabilitation programmes for eligible inmates, aimed at expanding the concept of restorative justice compared to punitive justice in the country's prison system.\n\"This approach is increasingly important in giving prisoners a second chance and facilitating their reintegration into society.\n\"Ultimately, the goal is for two-thirds of eligible inmates to undergo community-based rehabilitation programmes by 2030,\" he told reporters at the Bentong Prison Complex here yesterday.\nHe was speaking after the launch of the Madani PBSL programme, dubbed \"Kepulangan Yang Dinanti\" (The Awaited Return), held in conjunction with the Prisons Department Malaysia Day celebration.\nMeanwhile, Ahmad Faudzi said in February this year, the Prisons Department introduced the PBSL \"Fast Track\" programme and over the past eight months, a total of 2,670 inmates have been approved under this initiative.\nHe said that 2,560 inmates were released through the Ihsan Madani programme in conjunction with festive celebrations this year, while another 626 inmates will be released for Malaysia Day, including several from Bentong and Penor prisons in Kuantan.\n\"I hope families will provide full support to the released inmates to ensure they can start a new life without repeating past mistakes.\n\"We have officers ready to assist families facing challenges with inmates who relapse into old habits, and families may directly contact the assigned officers if such issues arise.\n\"The department is also working to increase the number of strategic partners to provide employment opportunities for released prisoners in sectors such as plantations, factories, workshops, and car wash services,\" he said.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "50b117a76af968fe",
      "title": "Asian shares rise as Japan politics weigh on yen",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271881/asian-shares-rise-japan-politics-weigh-yen",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:06:09Z",
      "summary": "HONG KONG: Asian markets rose on Monday, with Tokyo up nearly two percent after Japanese Prime Minister Shigeru Ishiba's decision to resign pushed down the value of the yen.\nInvestors were also digesting weak US jobs data, while crude prices climbed after eight key members of the OPEC+ alliance said they had agreed to again boost oil production.\n\"A combination of weak US labour market data coupled",
      "content": "HONG KONG: Asian markets rose on Monday, with Tokyo up nearly two percent after Japanese Prime Minister Shigeru Ishiba's decision to resign pushed down the value of the yen.\nInvestors were also digesting weak US jobs data, while crude prices climbed after eight key members of the OPEC+ alliance said they had agreed to again boost oil production.\n\"A combination of weak US labour market data coupled with rising political uncertainty in Japan dominated global markets as we started the week in Asia,\" Michael Wan at MUFG said in a note.\nTokyo's Nikkei index gained 1.9 percent, with Japanese exporters benefiting from a slide in the yen's value -- one dollar bought 148.14 yen in morning trade, up from 147.07 yen on Friday.\nJapanese bond yields also climbed after Ishiba said Sunday he would step down after less than a year in power, heralding fresh uncertainty for the world's fourth-largest economy.\n\"I don't think we can say that the resignation of PM Ishiba is a complete surprise as it's been mooted for some time but the timing of the announcement is certainly unexpected,\" said Michael Brown, senior research strategist at Pepperstone.\n\"As for the market reaction, this obviously introduces significant downside risks for the (Japanese yen) and for long-end\" Japanese government bonds (JGBs), he added.\nLast week, the yield on 30-year JGBs hit a record high, following rises in the United States and Europe on the back of concerns about political uncertainty and public finances.\nPotential candidates to be leader of Japan's ruling party are \"all likely to propose looser fiscal stances than Ishiba, hence further pressuring the long end of the curve, where demand for JGBs had already been waning quite significantly\", Brown said.\nHong Kong and Shanghai were 0.3 percent higher in morning trade, with Taipei up 0.5 percent and Seoul also gaining 0.3 percent.\nSingapore rose 0.1 percent and Wellington was up 0.1 percent, but Sydney fell 0.3 percent.\nLast week's US jobs data has cemented expectations of a Federal Reserve interest rate cut later this month.\nIn Asia, \"rising expectations of Fed rate cuts and with that lower US yields should be a welcome development to some extent providing some breathing space and policy room for Asian central banks\", said Wan of MUFG.\n\"Nonetheless, the key risk for Asian currencies would also lie in a sharp US slowdown and hard-landing recession through sharply slower exports to the US, which we stress is not our base case.\"\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "bf31c722a2a128ca",
      "title": "Palm falls on weaker Dalian; market awaits crucial data",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271879/palm-falls-weaker-dalian-market-awaits-crucial-data",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:02:50Z",
      "summary": "JAKARTA: Malaysian palm oil futures declined on Monday, tracking weaker edible oils at the Dalian futures, while the market awaited the Malaysian Palm Oil Board (MPOB) data due on Wednesday.\nThe benchmark palm oil contract for November delivery on the Bursa Malaysia Derivatives Exchange lost RM12, or 0.27 per cent, to RM4,436 (US$1,051.7) a metric ton in early trade.\nDalian's most-active soyoil co",
      "content": "JAKARTA: Malaysian palm oil futures declined on Monday, tracking weaker edible oils at the Dalian futures, while the market awaited the Malaysian Palm Oil Board (MPOB) data due on Wednesday.\nThe benchmark palm oil contract for November delivery on the Bursa Malaysia Derivatives Exchange lost RM12, or 0.27 per cent, to RM4,436 (US$1,051.7) a metric ton in early trade.\nDalian's most-active soyoil contract fell 0.17 per cent, while its palm oil contract shed 0.59 per cent. Soyoil prices on the Chicago Board of Trade (CBOT) gained 0.27 per cent.\nPalm oil tracks the price movements of rival edible oils as it competes for a share of the global vegetable oils market.\nMalaysia's palm oil inventories are forecast to rise for a sixth consecutive month in August, as production continues to outpace exports despite a recovery in demand, a Reuters survey showed.\nMeanwhile, China imported 49.49 million tonnes of crude oil in August, up 4.9 per cent month-on-month, per data from China's General Administration of Customs.\nOil prices climbed in early trade, trimming some of last week's losses, after OPEC+ agreed over the weekend to raise output at a slower pace from October on expectations of weaker global demand.\nStronger crude oil futures make palm a more attractive option for biodiesel feedstock.\nThe ringgit, palm's currency of trade, firmed 0.02 per cent against the dollar, making the commodity slightly expensive for buyers holding foreign currencies.\nPalm oil may retest support at RM4,405 per metric ton, a break below which could open the way toward RM4,367-RM4,381 range, Reuters technical analyst Wang Tao said.\nStocks rose and the dollar wobbled after dismal US labour data sealed the case for an interest rate cut this month, while the yen fell as investors girded for uncertainty in Japan following Prime Minister Shigeru Ishiba's resignation.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "9c9c4255a9897b04",
      "title": "#NSTviral: ABC is already in Europe, now let's look for a Ramly burger next [WATCH]",
      "url": "https://www.nst.com.my/news/nst-viral/2025/09/1271877/nstviral-abc-already-europe-now-lets-look-ramly-burger-next-watch",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T12:01:04Z",
      "summary": "STOCKHOLM: From the streets of Kuala Lumpur to the parks of Sweden, ice kacang is drawing attention as a refreshing summer dessert.\nA TikTok video by user wawawandering__ showing a Swedish man selling 'air batu campur' (ABC), or ice kacang, from a tricycle stall in a city park in Sweden has gone viral, attracting interest from both locals and Malaysians online.\nIn the video, the man pedals his cus",
      "content": "STOCKHOLM: From the streets of Kuala Lumpur to the parks of Sweden, ice kacang is drawing attention as a refreshing summer dessert.\nA TikTok video by user wawawandering__ showing a Swedish man selling 'air batu campur' (ABC), or ice kacang, from a tricycle stall in a city park in Sweden has gone viral, attracting interest from both locals and Malaysians online.\nIn the video, the man pedals his customised tricycle stall to a park fountain, where he prepares the colourful shaved ice dessert for customers.\nAccording to the caption, he purchased an old-school ice-shaving machine in Kuala Lumpur and brought it back to Sweden to recreate the Malaysian treat.\nEach serving of ice kacang is priced at 60 Swedish Krona, about RM27.\nHis stall offers shaved ice topped with red beans, sweetcorn, jelly, syrup and condensed or coconut milk — closely resembling the traditional version popular in Malaysia.\n@wawawandering__\nA Swedish guy jatuh cinta dengan ais kacang .  Dia siap beli mesin dari Malaysia and now buka cute bike stall kat Stockholm!   Musim panas kat Scandinavia dah tak complete tanpa shaved ice pelangi ni  dengan sirap manis, jagung, kacang merah & cendol.  From KL streets to Swedish summer vibes  ais kacang is the new chill star! ️\n#sweden\n#stockholm\n#malaysia\n#malaysiatiktok\n#fyp\nHanya di kau - Tan Sri P. Ramlee\nThe stall appears randomly at tourist spots such as Gamla Stan and Slussen throughout the summer. Customers can follow his Facebook page: The Lean Green Ais Kacang Machine for updates on his next location.\nThe TikTok user said: \"So yummy! This eases my longing for Malaysia a little. Whoever comes across this ice kacang bike stall can try ABC in Sweden.\"\nThe clip has since attracted millions of views, with many praising the vendor's effort as a unique way of sharing Malaysian food culture abroad.\n\"Ice kacang has even made its way to Sweden… this guy just can't move on, he misses Malaysia so much that he even bought a machine to sell it there,\" said user nazkamikaze.\nUser alifasyraf commented on the size and richness of the dessert: \"Wow, there's ice kacang! How did he make that? The toppings look rich… and it's big too.\"\nAnother user, stfuboiiii, joked: \"ABC is already here, now let's look for a Ramly burger next.\"\nBeloved for its colourful presentation and refreshing taste, ice kacang is a favourite treat enjoyed by Malaysians to beat the tropical heat.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "aedcbc9b35e7ee59",
      "title": "#BEAUTY: Tunisian women embrace their curls",
      "url": "https://www.nst.com.my/lifestyle/flair/2025/09/1271875/beauty-tunisian-women-embrace-their-curls",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:57:18Z",
      "summary": "TUNISIAN mother Mouna Jebali had long used a flat iron to straighten her thick hair, but with women everywhere challenging the stigma around natural looks, she has finally learned to love her curls.\nTo help her make what she called the \"transition\" to wearing her hair curly, she visited the North African country's first beauty salon specialising in natural hair.\n\"For years, I was taught that curly",
      "content": "TUNISIAN mother Mouna Jebali had long used a flat iron to straighten her thick hair, but with women everywhere challenging the stigma around natural looks, she has finally learned to love her curls.\nTo help her make what she called the \"transition\" to wearing her hair curly, she visited the North African country's first beauty salon specialising in natural hair.\n\"For years, I was taught that curly hair was not neat, that it had to be straightened or tied back,\" Jebali told AFP at Pineapple Studio in the capital, Tunis.\nShe said she finally came to accept her natural hair after tiny curls started forming on her little boy's head.\n\"That's when I said to myself: actually no, curly hair is beautiful,\" she said.\nIn countries around the world, beauty standards have shifted radically in recent years, with a growing number of beauty salons and cosmetic brands promoting natural styles.\nStill, the battle is far from won, and many women in Tunisia still rush to get their hair straightened ahead of a wedding or a meeting, and some fear that if they do not wear their hair straight for a job interview, they might not get hired.\nINDIGENOUS AND AFRICAN\nAdvocates for wearing one's natural hair believe that at the root of the stigma around curls lies a form of discrimination that they call \"texturism\".\n\"The further you move away from what is considered Afro, kinky or curly, the more socially accepted you are,\" said Nawal Benali, a journalist and host of a podcast on racism in North Africa.\n\"Because that's a marker of proper appearance and presentability.\"\nBenali said the standards had first been set in \"the white, Western world\", calling the obsession around straight hair an attempt to \"erase our Indigenous and African features\".\nDhouha Mechergui, who co-founded Pineapple Studio, recalled having her hair straightened by her mother ahead of every religious holiday growing up.\nShe said it took courage to make her own switch to natural, and that she had to work hard to convince women to embrace their curls and come to her salon.\n\"Sometimes I play the role of psychiatrist, because I know making that decision is very difficult,\" she said.\nAside from the drive for greater authenticity, health concerns have become a part of the debate, with one major study by the US National Institutes of Health linking chemical hair straightening products to a higher risk of uterine cancer.\n'WE ARE PROUD'\nFor generations, people around the world were told to straighten, braid, cut or otherwise conceal their curls, or else get sent home from school or work.\nA global drive buoyed by the Black Lives Matter movement gave rise to a major pandemic-era trend of beauty videos celebrating natural hair.\nThe push did not go unnoticed: French lawmakers last year voted to ban discrimination based on hair texture, while several US states have passed similar legislation.\nTunisia has no such initiative, so women entrepreneurs are leading the change.\nIn 2021, Sirine Cherif cofounded Kamaana — or \"as I am\" — Tunisia's first homegrown haircare brand dedicated to curly locks.\n\"When we started, we were the only specialised brand on the market,\" she said.\n\"A few months later, there was a domino effect: bigger brands launched their own curly-hair lines.\"\nAnd today, Tunisian companies such as Zynia and Lilas Cosmetics have joined the growing industry.\nFor Cherif, the boom is both a lucrative business opportunity and a marker of profound social change.\n\"We are proud to have encouraged people to be themselves, to resist this societal pressure and embrace their natural hair,\" she said.\nHer company has seen 42 per cent annual growth since its founding, she said, adding: \"We want to start a curl revolution.\"\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "4b3a0551bf3654b8",
      "title": "[UPDATED] Maju Holdings director Abu Sahid pleads not guilty to CBT, money laundering",
      "url": "https://www.nst.com.my/news/crime-courts/2025/09/1271872/updated-maju-holdings-director-abu-sahid-pleads-not-guilty-cbt",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:51:35Z",
      "summary": "KUALA LUMPUR: Maju Holdings Sdn Bhd director Tan Sri Abu Sahid Mohamed claimed trial at the Sessions Court today to four charges of criminal breach of trust (CBT) involving RM313 million, and 13 counts of money laundering amounting to RM139 million, in connection with the proposed Putrajaya to KLIA (MEX II) highway project.\nThe 74-year-old prominent corporate figure, dressed in an all-white outfit",
      "content": "KUALA LUMPUR: Maju Holdings Sdn Bhd director Tan Sri Abu Sahid Mohamed claimed trial at the Sessions Court today to four charges of criminal breach of trust (CBT) involving RM313 million, and 13 counts of money laundering amounting to RM139 million, in connection with the proposed Putrajaya to KLIA (MEX II) highway project.\nThe 74-year-old prominent corporate figure, dressed in an all-white outfit and seated in a wheelchair, entered his plea before Judge Suzana Hussin.\n\"I understand... I plead not guilty,\" he said after each charge was read out by court interpreters.\nAt the start of proceedings, Abu Sahid's lawyer, Datuk Hisyam Teh Poh Teik, requested that his client be allowed to remain seated in a wheelchair while the charges were read out.\n\"He is not too well. He cannot stand for long,\" he said to the judge.\nThe bespectacled Abu Sahid, who is listed in the company's website as its group executive chairman, was seen seated in a wheelchair with an oxygen tank beside him, in a packed courtroom filled with family members and friends.\nOn the first to the fourth CBT charges, Abu Sahid was alleged to have fraudulently misused RM313,124,617.02 that belonged to Maju Holdings and entrusted to him in his capacity as director of the company at a bank in Bukit Tunku between May 3, 2016 and Oct 21, 2019.\nThe charges under Section 409 of the Penal Code carry a jail term of not less than two years and not exceeding 20 years, with whipping and a fine upon conviction.\nAs for the first to 10th money laundering charges, Abu Sahid was accused of transferring RM 116,449,536.12, which is money believed to be from illegal proceeds from his bank account to five individuals and four construction companies' accounts at the same bank between May 4, 2016 and Oct 29, 2019.\nFor the 11th to 13th money laundering charges, Abu Sahid was accused of disposing of RM22,802,612.86 from illegal proceeds by cashing out multiple cheques from his bank account at the same bank between May 4, 2016 and Sept 19, 2018.\nThe charges under Section 4(1)(b) of the Money Laundering, Anti-Terrorism Financing and Proceeds of Unlawful Activities Act (AMLA), punishable under Section 4(1), carry a maximum 15-year jail term; a fine not less than five times the amount of proceeds from illegal activities or RM5 million, whichever is higher.\nDeputy public prosecutor Datuk Ahmad Akram Gharib suggested a RM1.5 million bail with one surety.\n\"The prosecution and defence agree to this bail sum if Yang Arif wishes to use the discretion to grant bail and for his passport to be impounded for both cases.\"\nTeh did not object.\nAhmad Akram also applied for the CBT and money laundering case to be tried together, which Suzana allowed.\nSuzana then granted a RM1.5 million bail with one surety and ordered Abu Sahid to surrender his passport to the court.\nThe court set Nov 3 for mention.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "5ae483a0c4726234",
      "title": "SME Corp, microLEAP roll out RM35mil financing to boost SME growth",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271870/sme-corp-microleap-roll-out-rm35mil-financing-boost-sme-growth",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:48:30Z",
      "summary": "KUALA LUMPUR: SME Corp Malaysia and microLEAP will channel RM35 million to small and medium enterprises (SMEs) through the 2025 Business Accelerator Programme (BAP) Alternative Financing initiative.\nThe programme offers SMEs shariah-compliant financing of up to RM400,000 at a 3.5 per cent profit rate per annum, with the possibility of 40 per cent of the financing being converted into a grant.\nmicr",
      "content": "KUALA LUMPUR: SME Corp Malaysia and microLEAP will channel RM35 million to small and medium enterprises (SMEs) through the 2025 Business Accelerator Programme (BAP) Alternative Financing initiative.\nThe programme offers SMEs shariah-compliant financing of up to RM400,000 at a 3.5 per cent profit rate per annum, with the possibility of 40 per cent of the financing being converted into a grant.\nmicroLEAP, a shariah-compliant P2P financing, is the financing intermediary under this programme. With the additional allocation from SME Corp. Malaysia, the total funds allocated under the collaboration with microLEAP since 2021 is now RM70 million.\nSME Corp chief executive officer (CEO) Rizal Nainy said this programme reflects the company's commitment to rethinking SME support, not just through financing, but by embedding incentives that reward financial discipline and business growth.\n\"By enabling up to 40 per cent grant conversion, we are not only reducing the burden of repayment but actively investing in the future of high-potential Malaysian SMEs that are ready to be scaled up, in line with our target to upscale small enterprises to medium-sized enterprises from 1.6 per cent currently to 5 per cent by 2030,\" he said in a statement.\nThe programme offers assistance for both working capital and business improvement purposes, namely machinery and equipment purchases, ESG adoption, product certification, advertising and promotion and ICT adoption.\nOnly SMEs with a timely repayment track record will be eligible to apply for the grant conversion of up to 40 per cent of their financing, subject to approval from SME Corp.\n\"We believe financing should not just be accessible and affordable; it should also reward good financial discipline. Through our collaboration with SME Corp, we are proud to offer a financing product that does just that.\n\"We've always believed that SMEs should not need three years of audited accounts or collateral to access financing. If they're generating revenue and growing, and they can afford the financing, we will be there to support them,\" said microLEAP founder and CEO Tunku Danny Nasaifuddin Mudzaffar.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "81411a32ea86278a",
      "title": "Malaysia secures RM15.6bil in potential deals at Expo 2025 Osaka, surpassing target",
      "url": "https://www.nst.com.my/business/economy/2025/09/1271868/malaysia-secures-rm156bil-potential-deals-expo-2025-osaka",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:38:02Z",
      "summary": "OSAKA: Malaysia has recorded approximately RM15.6 billion in potential trade and investment at Expo 2025 Osaka, exceeding its original target of RM13 billion, says Deputy Prime Minister Datuk Seri Fadillah Yusof.\nFadillah, who is also the Energy Transition and Water Transformation Minister, said the achievement was 120 per cent of the baseline goal, underscoring Malaysia's growing global appeal an",
      "content": "OSAKA: Malaysia has recorded approximately RM15.6 billion in potential trade and investment at Expo 2025 Osaka, exceeding its original target of RM13 billion, says Deputy Prime Minister Datuk Seri Fadillah Yusof.\nFadillah, who is also the Energy Transition and Water Transformation Minister, said the achievement was 120 per cent of the baseline goal, underscoring Malaysia's growing global appeal and the strength of its international partnerships.\n\"The success is driven by a whole-of-government approach, with the Malaysia Pavilion offering a dynamic range of activities and showcases each week.\n\"Until the conclusion of the expo on Oct 13, we aim to host over 208 business programmes and 98 non-business activities,\" he said in his speech at the Malaysia National Day ceremony here today.\nThe text of his speech was read by Chief Secretary to the Government Tan Sri Shamsul Azri Abu Bakar.\nFadillah said the Malaysia Pavilion continues to attract global attention through its curated industry weeks, which highlight key sectors such as green energy, halal innovation, digital transformation and advanced manufacturing.\nHe said these programmes are aligned with Malaysia's national policies including the Green Investment Strategy (GIS) and the National Semiconductor Strategy (NSS), while promoting high-value sectors such as aerospace, electrical and electronics (E&E), pharmaceuticals and digital economy.\nHe said the initiatives reflects Malaysia's National Industrial Master Plan 2030 and the MADANI Economy framework.\nFadillah said the Malaysia Pavilion at Expo 2025 Osaka has emerged as one of the most vibrant attractions welcoming over 2.8 million visitors since opening on April 13, nearly double its original target of 1.5 million\nHe also said the strong response reflects the pavilion's unique appeal, blending Malaysia's people, culture and heritage into a compelling story of harmony.\n\"Its bamboo facade, inspired by interwoven songket fabric, casts an ethereal glow at night to symbolise unity and diversity, while the interior design with Malaysian wood and natural tones connects the nation's landscapes with shared traditions of Japan,\" he added.\nFadillah said that beyond architecture, visitors have been captivated by daily cultural performances, business programmes and live culinary showcases particularly the famous \"roti canai\", helping it secure a nomination as the Best International Gourmet Pavilion.\n\"These initiatives elevate Malaysia's brand and set the stage for Visit Malaysia Year 2026, when we will welcome the world with our renowned Malaysian hospitality,\" he added.\nFadillah said Malaysia's ambition at Expo 2025 is to translate synergy into sustainable outcomes and the pavilion is positioning the nation to attract investments, strengthen key industries and integrate Malaysian businesses with global supply chains.\n\"As the expo nears its end in 35 days, I invite everyone to make the most of this opportunity to connect with us and discover the charm of our pavilion,\" he added.\nExpo 2025 Osaka was a six-month event, running from April 13 to Oct 13, on the man-made island of Yumeshima in Osaka. Themed \"Designing Future Society for Our Lives\", the expo showcases innovative ideas, technologies and a diverse range of exhibits and events.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "2d40019e0a546a88",
      "title": "DXN's high-stakes moves: From private jet to Burj Khalifa apartment",
      "url": "https://www.nst.com.my/property/2025/09/1271866/dxns-high-stakes-moves-private-jet-burj-khalifa-apartment",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:35:59Z",
      "summary": "KUALA LUMPUR: DXN Holdings Bhd, a health and wellness multi-level marketing company, is strengthening its Middle East footprint with the acquisition of a luxury apartment in Dubai's Burj Khalifa for RM7.37 million – the latest in a string of big-ticket moves aimed at boosting its international profile.\nAccording to its recent filing, the unit is being acquired from executive chairman and major sha",
      "content": "KUALA LUMPUR: DXN Holdings Bhd, a health and wellness multi-level marketing company, is strengthening its Middle East footprint with the acquisition of a luxury apartment in Dubai's Burj Khalifa for RM7.37 million – the latest in a string of big-ticket moves aimed at boosting its international profile.\nAccording to its recent filing, the unit is being acquired from executive chairman and major shareholder Datuk Lim Siow Jin through DXN's wholly owned unit, Daxen Middle East Food Manufacturing LLC. The purchase qualifies as a related party transaction, as Lim controls 58.36 per cent of DXN via direct holdings, his wife Datin Leong Bee Ling, and LSJ Global Sdn Bhd.\nWhile DXN argued the unit would boost branding and member engagement, some investors saw it as an unnecessary luxury acquisition.\nDXN said the property, financed entirely through internal funds, will serve as a venue for leadership training, content creation, VIP events, and member programmes, with potential for rental income.\nThe company added that the investment represents less than 0.6 per cent of its RM1.3 billion net assets as of Feb 28, 2025, and will not affect its balance sheet, dividends, R&D spending or expansion plans.\nDXN frames this purchase as part of a broader strategy to enhance branding and member engagement, likening it to lifestyle hubs such as Boulder Valley Glamping in Penang and DXN Cyberville in Cyberjaya. However, questions inevitably arise over timing and scale.\nThis is not DXN's first high-profile investment to draw attention. Last year, it chartered a Gulfstream G550 jet from a Lim-linked entity for up to US$6.6 million annually – an amount equal to 11 per cent of its FY2024 net profit. While the company defended the jet lease as essential for global operations, the optics of pairing a private jet with a Burj Khalifa apartment are bound to fuel debate about spending priorities.\nMarket observers note that such investments have drawn attention and prompted discussion over capital allocation, particularly as DXN's net profit fell 13.6 per cent year-on-year in the first quarter of the financial year 2026 to RM73.9 million due to forex losses, despite a modest rise in revenue.\nThat said, DXN's global ambitions are real. With 11 of its 13 factories located overseas, Latin America contributing nearly 60 per cent of sales, and the Middle East now accounting for more than 10 per cent of revenue, international expansion is central to its growth story.\nThe challenge for DXN is balance. Growth and branding matter, but so do transparency, governance, and financial discipline. If the company can demonstrate that its high-profile spending translates into measurable returns, it may gain higher investor confidence.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "d9298513a79cc038",
      "title": "Zara inquest: 21 evidence bags of handwritten documents, books submitted to Chemistry Department",
      "url": "https://www.nst.com.my/news/crime-courts/2025/09/1271864/zara-inquest-21-evidence-bags-handwritten-documents-books",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:32:09Z",
      "summary": "KOTA KINABALU: The Coroner's Court was told today that 21 police case evidence bags containing handwritten documents were handed over to the Chemistry Department in Petaling Jaya, Selangor.\nThis was revealed by Nurul Atiqah Mohd Noh, a document examiner at the Document Examination Division, Forensic Science Analysis Centre of the Chemistry Department, who testified as the second witness in the inq",
      "content": "KOTA KINABALU: The Coroner's Court was told today that 21 police case evidence bags containing handwritten documents were handed over to the Chemistry Department in Petaling Jaya, Selangor.\nThis was revealed by Nurul Atiqah Mohd Noh, a document examiner at the Document Examination Division, Forensic Science Analysis Centre of the Chemistry Department, who testified as the second witness in the inquest into the death of the late Zara Qairina Mahathir.\nShe said all documents marked W1 to W6, Y1 to Y7, and Y9 to Y15 bore the police 314 seal, along with a Police Form 31 under complaint number Kinarut 1776/25, and were received at 8.37am on Aug 20.\nDuring proceedings, Nurul Atiqah re-identified the documents, which included sheets of paper containing handwriting marked 'Y', as well as exercise books, workbooks, and notebooks belonging to the late Zara Qairina, marked 'W'.\nToday's proceedings began at 9.20am before Coroner Amir Shah Amir Hassan, with Dana Arabi Wazani as the conducting officer who questioned the witness.\nNurul Atiqah, 44, is the second witness in the inquest into Zara Qairina's death, with 21 years of experience as a science officer at the Chemistry Department.\nHer duties include receiving cases, preparing chemical reports, and examining disputed documents involving analysis such as signatures, handwriting, typewriting, alterations, printing processes, paper and ink.\n\"I have also testified in court when required. To my knowledge, my testimony has been accepted by the court,\" she said in her witness statement.\nShe explained that the handwriting in the documents was examined and compared with available samples to determine whether it belonged to the late Zara Qairina.\n\"I examined all the handwriting and compared the disputed writings with all the sample writings.\n\"I observed the handwriting characteristics of both and identified similarities and differences.\n\"I used a magnifying glass and a scientific instrument, the Video Spectral Comparator, in my examination,\" she said.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "a4f760bfb103a69a",
      "title": "Kelantan MMEA pushes for radar system to tighten border security",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271862/kelantan-mmea-pushes-radar-system-tighten-border-security",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:25:23Z",
      "summary": "TUMPAT: Kelantan's maritime authority is seeking federal approval to install a radar system in Pengkalan Kubor to step up surveillance and curb cross-border crime along the Malaysian–Thai border.\nMalaysian Maritime Enforcement Agency (MMEA) state director Erwan Shah Soahdi said the radar would significantly boost monitoring efforts and reinforce ongoing operations against smuggling and other illic",
      "content": "TUMPAT: Kelantan's maritime authority is seeking federal approval to install a radar system in Pengkalan Kubor to step up surveillance and curb cross-border crime along the Malaysian–Thai border.\nMalaysian Maritime Enforcement Agency (MMEA) state director Erwan Shah Soahdi said the radar would significantly boost monitoring efforts and reinforce ongoing operations against smuggling and other illicit activities.\n\"The MMEA has proposed to the Home Ministry to establish a Remote Sensor Site (RSS) Swasla radar system at Mukim Tabar, which borders Thailand.\n\"The location is very strategic as it covers the coastal waters used as entry points by smugglers before they head inland via river estuaries.\n\"With the radar in place, detection of cross-border criminal activities will be more effective,\" he told reporters during a visit to the border yesterday.\nRSS is a key part of Malaysia's Sea Surveillance System (Swasla), a 24-hour radar network that monitors vessel movements, enforces maritime laws and strengthens national security.\nThe Kelantan–Thai border has long been a hotspot for cross-border crimes, with syndicates exploiting coastal waters and river estuaries to smuggle goods, drugs and even migrants into Malaysia.\nAuthorities say constant surveillance is crucial to curb these illegal activities.\nErwan said the MMEA has also proposed building a permanent Pengkalan Kubor maritime base along with a radar facility to strengthen surveillance on the east coast.\nHe added that the proposal has been submitted to the agency's Development Division and forwarded to the Home Ministry for approval.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "64c150d50e7ecdc8",
      "title": "New Zealand fugitive father on the run with children shot dead by police",
      "url": "https://www.nst.com.my/world/world/2025/09/1271860/new-zealand-fugitive-father-run-children-shot-dead-police",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:20:19Z",
      "summary": "WELLINGTON: A New Zealand father who had been on the run with his three children for nearly four years was shot dead by police on Monday after robbing a farm supply store, police said.\nTom Phillips disappeared with his three children, now aged 9, 10, and 12, in late 2021 in a case that has made national headlines over his ability to evade arrest.\nA police officer was shot and seriously injured in ",
      "content": "WELLINGTON: A New Zealand father who had been on the run with his three children for nearly four years was shot dead by police on Monday after robbing a farm supply store, police said.\nTom Phillips disappeared with his three children, now aged 9, 10, and 12, in late 2021 in a case that has made national headlines over his ability to evade arrest.\nA police officer was shot and seriously injured in the attempt to arrest Phillips, New Zealand police acting deputy commissioner Jill Rogers said at a press conference.\nPolice were alerted to a robbery at the store in a small rural town in the region of Waikato around 2.30am and laid spikes on the road to stop the suspects - Phillips and one of his children - were expected to take.\nPhillips' motorbike hit the spikes, and the first officer at the scene was \"confronted by gunfire at close range,\" Rogers said.\n\"Our officer has been struck in the head. He's immediately fallen to the ground and taken cover.\"\nShe said a second police officer then arrived and Phillips was shot, and despite efforts to save him died at the scene.\nRogers added that while Phillips had not been formally identified, police believe it is him.\nPolice said one of his children is now with authorities, but they are seeking to locate the other children.\n\"We hold serious concerns for those children, and our focus is on finding them,\" she said.\nPhillips failed to attend a court hearing in 2022 and has been pursued by police ever since.\nHe evaded authorities by allegedly hiding out in dense bush and remote farmland in New Zealand's central North Island.\nThe three children's mother, referred to as just Cat, said in a statement to state-owned Radio New Zealand that events this morning had brought up a wave of complex emotions.\n\"They have been dearly missed every day for nearly four years, and we are looking forward to welcoming them home with love and care,\" she said.\nPhillips's efforts to evade police in the remote area of the Waikato region have remained in local media headlines since their disappearance, as New Zealanders have struggled to understand how they have not been captured.\nBefore disappearing, Phillips had lived in the small farming community of Marokopa, near the west coast, home to less than 100 people. Piopio, where the robbery occurred on Monday, was roughly an hour and a half by road from Marokopa.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "ac11eb5576737695",
      "title": "Pedersen wins Vuelta stage 15 as protesters again impact race",
      "url": "https://www.nst.com.my/sports/cycling/2025/09/1271857/pedersen-wins-vuelta-stage-15-protesters-again-impact-race",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:12:10Z",
      "summary": "MONFORTE DE LEMOS, (Spain): Mads Pedersen sprinted to Vuelta stage 15 victory on Sunday as pro-Palestinian protestors again made an impact on the race.\nSpanish cyclist Javier Romo fell with 56 kilometres remaining amid a disturbance caused by a protestor who slipped on the side of the road as he ran towards a group of riders, with Romo then appearing to run after the person before mounting his bik",
      "content": "MONFORTE DE LEMOS, (Spain): Mads Pedersen sprinted to Vuelta stage 15 victory on Sunday as pro-Palestinian protestors again made an impact on the race.\nSpanish cyclist Javier Romo fell with 56 kilometres remaining amid a disturbance caused by a protestor who slipped on the side of the road as he ran towards a group of riders, with Romo then appearing to run after the person before mounting his bike and continuing with the race.\nLocal media reported that 10 protestors were arrested for public disorder offences, and some tussled with police near the end of the race.\nRace organisers erected extra barriers to preserve the integrity of the course and allow riders to finish the stage.\nProtestors waved Palestine flags en masse at the start and end of the day's racing.\nThe race has been disrupted numerous times, including the 11th stage being shortened because of protests at the finish line in Bilbao.\nTwo-time Tour de France winner Jonas Vingegaard retained the red jersey as overall leader, maintaining his 48-second lead on Joao Almeida.\nDanish Lidl-Trek rider Pedersen scored his first victory of this year's race with a blistering burst past Marco Frigo on the home straight of the hilly stage, running 167.8 kilometres from A Veiga to Monforte de Lemos.\nFrigo, riding for Israel-Premier Tech, the team targeted by the protests, came in third behind Orluis Aular.\nPedersen's team-mates pulled hard for him in the day's large breakaway to give him the chance to triumph.\n\"It makes the victory even sweeter,\" said Pedersen.\n\"They worked so hard to make it possible, it makes it even nicer to win when everyone is looking at us and everyone knew our plan.\"\nThe stage win bolstered Pedersen's hopes of holding onto the green jersey for the most points, currently leading Vingegaard by 98.\nThe peloton, featuring Vingegaard and the other main contenders, finished 13-and-a-half minutes after Pedersen crossed the line.\nAfter a rest day on Monday, the race resumes with stage 16 on Tuesday, running 167.9km from Poio to Castro de Herville. — AFP\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "376b5fa6a83561a2",
      "title": "Yen sinks after Japan PM Ishiba resigns",
      "url": "https://www.nst.com.my/business/economy/2025/09/1271855/yen-sinks-after-japan-pm-ishiba-resigns",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:07:15Z",
      "summary": "SINGAPORE: The yen fell broadly on Monday following news that Japanese Prime Minister Shigeru Ishiba had resigned, while the dollar was nursing losses after tumbling on a weak US jobs report that cemented expectations for a Federal Reserve rate cut this month.\nFocus for markets on Monday will also be on French Prime Minister Francois Bayrou's confidence vote, which he is expected to lose, plunging",
      "content": "SINGAPORE: The yen fell broadly on Monday following news that Japanese Prime Minister Shigeru Ishiba had resigned, while the dollar was nursing losses after tumbling on a weak US jobs report that cemented expectations for a Federal Reserve rate cut this month.\nFocus for markets on Monday will also be on French Prime Minister Francois Bayrou's confidence vote, which he is expected to lose, plunging the euro zone's second-largest economy deeper into political crisis.\nJapan's Ishiba on Sunday announced his resignation, ushering in a potentially lengthy period of policy uncertainty at a shaky moment for the world's fourth-largest economy.\nThe yen slumped in response in Asia trade on Monday, falling 0.6 per cent against the dollar to 148.25.\nThe Japanese currency similarly slid to its lowest in more than a year against the euro and sterling at 173.91 and 200.33, respectively.\nInvestors are focusing on the chance of Ishiba being replaced by an advocate of looser fiscal and monetary policy, such as Liberal Democratic Party (LDP) veteran Sanae Takaichi, who has criticised the Bank of Japan's interest rate hikes.\n\"The probability of an additional rate hike in September was never seen as high to begin with, and September is likely to be a wait-and-see,\" Hirofumi Suzuki, chief currency strategist at SMBC, said of the BOJ's next move.\n\"From October onward, however, outcomes will in part depend on the next prime minister, so the situation should remain live.\"\nConcerns over political uncertainty prompted a selloff in the yen and Japanese government bonds (JGBs) last week, sending the yield on the 30-year bond to a record high.\n\"With the LDP lacking a clear majority, investors will be cautious until a successor is confirmed, keeping volatility elevated across yen, bonds and equities,\" said Charu Chanana, chief investment strategist at Saxo.\n\"Near-term, that argues for a softer yen, higher JGB term-premium, and two-way equities until the successor profile is clear.\"\nFormer Japanese foreign minister Toshimitsu Motegi said he would run in the race to decide the next head of the LDP, Kyodo reported on Monday.\nThe yen hardly reacted to Monday's data, which showed Japan's economy expanded much faster than initially estimated in the second quarter.\nSEPTEMBER FED CUT BAKED IN\nThe dollar was recouping some of its heavy losses, helped in part by the yen's weakness, after falling sharply on Friday on data that showed further cracks in the US labour market.\nThe nonfarm payrolls report showed US job growth weakened sharply in August and the unemployment rate increased to nearly a four-year high of 4.3 per cent.\nInvestors ramped up bets of an outsized 50-basis-point rate cut from the Fed later this month following the release and are now pricing in an 8 per cent chance of such a move, as compared to none a week ago, according to the CME FedWatch tool.\nAgainst the dollar, sterling fell 0.11 per cent to US$1.3492, having risen more than 0.5 per cent on Friday. The euro was similarly down 0.11 per cent at US$1.1709, after hitting a more than one-month high on Friday.\nThe dollar index steadied at 97.87, after sliding more than 0.5 per cent on Friday.\n\"Given the more elevated downside risks to the employment side of the mandate, we think a rate cut at the September meeting is all but assured. We continue to expect a 25bp cut at that meeting,\" said Barclays economists in a note.\n\"However, we change our Fed call by adding another 25bp cut in October, while leaving our December cut unchanged. In all, we now think the FOMC will proceed with three 25bp cuts this year, easing the policy stance in the face of the slowing labor market.\"\nUS Treasury Secretary Scott Bessent on Friday called for renewed scrutiny of the Fed, including its power to set interest rates, as the Trump administration intensifies its efforts to exert control over the central bank.\nPresident Donald Trump is considering three finalists for Federal Reserve chair to replace Jerome Powell, whom the president has criticised all year for not cutting rates as he has demanded.\nElsewhere, the Australian dollar was up 0.05 per cent at US$0.6558, while the New Zealand dollar eased 0.03 per cent to US$0.5891.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "2df7ed5cb45b2dfd",
      "title": "Gold hovers near record high on US rate-cut prospects",
      "url": "https://www.nst.com.my/business/economy/2025/09/1271853/gold-hovers-near-record-high-us-rate-cut-prospects",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:04:54Z",
      "summary": "NEW YORK: Gold held firm near an all-time high on Monday, inching closer to a key US$3,600 level, bolstered by mounting expectations of a US Federal Reserve rate cut this month following a weaker-than-expected jobs report last week.\nSpot gold was flat at US$3,586.81 per ounce, as of 0121 GMT. Bullion rose to a record high of US$3,599.89 on Friday.\nUS gold futures for December delivery fell 0.7 per",
      "content": "NEW YORK: Gold held firm near an all-time high on Monday, inching closer to a key US$3,600 level, bolstered by mounting expectations of a US Federal Reserve rate cut this month following a weaker-than-expected jobs report last week.\nSpot gold was flat at US$3,586.81 per ounce, as of 0121 GMT. Bullion rose to a record high of US$3,599.89 on Friday.\nUS gold futures for December delivery fell 0.7 per cent to US$3,626.10.\n\"The main driver is US jobs data and the expectations now that the Fed could cut by 50 basis points in September. It's a marginal chance but a material shift from before the jobs figures,\" Capital.com financial market analyst Kyle Rodda said.\n\"Basically...all of the tailwinds are blowing for gold at the moment and notwithstanding an inflation shock this week, we will make a good test of US$3,600.\"\nUS job growth weakened sharply in August, and the unemployment rate increased to a nearly four-year high of 4.3 per cent, confirming that labor market conditions were softening and sealing the case for a Fed rate cut next week.\nTraders have fully priced in a 25-bp cut this month, with an 8 per cent chance of a jumbo 50-bp rate cut, according to the CME FedWatch tool.\nLower interest rates decrease the opportunity cost of holding non-yielding bullion and weigh on the dollar, making gold cheaper for investors holding other currencies.\nFocus now shifts to the US inflation report on Thursday that could offer more clarity on the size of the Fed's expected rate cut.\nBullion has surged 37 per cent so far this year after a 27 per cent gain in 2024, driven by the dollar's weakness, central bank buying, a softening monetary policy backdrop, and wider geopolitical and economic uncertainty.\nChina's central bank added gold to its reserves in August, extending purchases of bullion into a 10th straight month.\nMeanwhile, gold speculators raised net long positions by 20,740 contracts to 168,862 in the week ended September 2.\nElsewhere, spot silver fell 0.5 per cent to US$40.75 per ounce. Platinum rose 0.1 per cent to US$1,374.35, and palladium was flat at US$1,109.71.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "e2472b432e1969b7",
      "title": "MARKET PULSE AM SEPT 8, 2025 [WATCH]",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271851/market-pulse-am-sept-8-2025-watch",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:02:56Z",
      "summary": "KUALA LUMPUR: News on the latest moves on the stock and crypto markets.\nBursa Malaysia's 30-stock index opened higher on Monday, catching up with regional markets that rallied last Friday.\nThe barometer index is expected to play catch-up with the strong regional performance last Friday.\nThe FTSE Bursa Malaysia KLCI is expected to hover within the range of 1,580 to 1,595 today.\nIn the cryptocurrenc",
      "content": "KUALA LUMPUR: News on the latest moves on the stock and crypto markets.\nBursa Malaysia's 30-stock index opened higher on Monday, catching up with regional markets that rallied last Friday.\nThe barometer index is expected to play catch-up with the strong regional performance last Friday.\nThe FTSE Bursa Malaysia KLCI is expected to hover within the range of 1,580 to 1,595 today.\nIn the cryptocurrency market, Bitcoin fell to RM470,039.\nFollowing the same trend, Ethereum fell to RM18,199, while Solana traded at RM876.\nThat is it for Market Pulse.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "761cf93e0f8a371d",
      "title": "Anwar: History must be interpreted through moral values",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271849/anwar-history-must-be-interpreted-through-moral-values",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T11:02:40Z",
      "summary": "PUTRAJAYA: Prime Minister Datuk Seri Anwar Ibrahim today reminded historians and scholars that the interpretation of history must be guided by both moral values and noble principles that define civilisation and culture.\nSpeaking at the launch and inaugural meeting of the National Historians Council at the Putrajaya International Convention Centre (IPCC), Anwar said history is not merely about reco",
      "content": "PUTRAJAYA: Prime Minister Datuk Seri Anwar Ibrahim today reminded historians and scholars that the interpretation of history must be guided by both moral values and noble principles that define civilisation and culture.\nSpeaking at the launch and inaugural meeting of the National Historians Council at the Putrajaya International Convention Centre (IPCC), Anwar said history is not merely about recording events, but about highlighting what is noble, recognised, and refined, so these values can be firmly instilled in society.\n\"History has to be studied from a moral point of view.\n\"It does not run away from the truth and the fate of history. Our role is to provide empirical data in history,\" he said.\nHe added that the interpretation of history must emphasise what is considered noble, familiar, and refined, and these values should be introduced into the system and instilled firmly.\nAnwar recalled the early attempts during the Asian Historians Conference in 1961, noting that while not all earlier efforts were perfect, they laid the groundwork for shaping Malaysia's intellectual tradition.\nHe also drew on the writings of Belgian historian Henri Pirenne, who argued that the concept of modernity and rationalism in Europe only emerged after its encounter and interaction with Islamic civilisation.\n\"When we study our own history, we must look from this perspective.\n\"We cannot disregard earlier influences, especially Islam, which brought deep change to our culture — from food and clothing to daily practices and ways of thinking about what is good and what is not,\" he said.\nAnwar added that while the establishment of the National Historians Council is an important step, it is not the first attempt to correct or straighten out Malaysian history.\n\"There have been many earlier works that supported this concept. Our task is to embrace these strengths, continue the discourse, and provide advice to the government on the next steps,\" he said.\nAlso present were National Unity Minister Datuk Seri Aaron Ago Dagang, his deputy, Saraswathy Kandasami, and Dewan Rakyat Speaker Tan Sri Johari Abdul.\nThe council, approved by the Cabinet on Jan 24, 2025, comprises 17 members, including historians, archaeologists, anthropologists, sociologists, and representatives from the ministries of National Unity, Higher Education, and Education.\nTheir two-year term runs from Aug 1 to July 31, 2027.\nThe council will regulate research, source referencing, writing, publishing, history education, and historical advocacy to ensure the nation's heritage and contributions are duly recorded and preserved.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "e31b4498c3f5b9fa",
      "title": "Ringgit rises against greenback on weak US jobs data",
      "url": "https://www.nst.com.my/business/economy/2025/09/1271846/ringgit-rises-against-greenback-weak-us-jobs-data",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T10:59:04Z",
      "summary": "KUALA LUMPUR: The ringgit opened stronger against the US dollar on Monday, lifted by growing expectations of United States (US) interest rate cuts after weaker nonfarm payrolls (NFP) data.\nAt 8 am, the local currency stood at 4.2030/2285 per dollar, up from Thursday's close of 4.2260/2320. Markets were closed on Friday for the Maulidur Rasul holiday.\nBank Muamalat Malaysia Bhd chief economist Dr M",
      "content": "KUALA LUMPUR: The ringgit opened stronger against the US dollar on Monday, lifted by growing expectations of United States (US) interest rate cuts after weaker nonfarm payrolls (NFP) data.\nAt 8 am, the local currency stood at 4.2030/2285 per dollar, up from Thursday's close of 4.2260/2320. Markets were closed on Friday for the Maulidur Rasul holiday.\nBank Muamalat Malaysia Bhd chief economist Dr Mohd Afzanizam Abdul Rashid said the softer-than-expected US August NFP report should pave the way for a rate cut at next week's Federal Open Market Committee (FOMC) meeting.\nHowever, he noted the ringgit may trade cautiously amid political developments in Japan, which could lend support to the dollar.\n\"The situation in Japan, where the prime minister has offered his resignation, appears dollar-positive as the next leadership is expected to be more dovish on fiscal policy. On that note, the US dollar against the ringgit could range between 4.21 and 4.23 today,\" he told Bernama.\nThe ringgit was mostly higher against major currencies in early trade. It strengthened to 2.8322/8496 versus the yen from 2.8489/8531 last week and rose to 5.6694/7038 against the pound from 5.6793/6874. It was little changed against the euro at 4.9213/9512 compared with 4.9203/9273 previously.\nAgainst ASEAN currencies, the ringgit traded mostly firmer. It advanced to 256.5/257.9 against the rupiah from Thursday's 257.3/257.7, climbed to 3.2706/2867 versus the Singapore dollar from 3.2775/2824, and gained to 7.35/7.39 against the peso from 7.40/7.42.\nIt slipped to 13.0454/1158 against the baht from 13.0666/0908 last week.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "6cfa1ad928691554",
      "title": "Fed rate cut optimism boosts sentiment, yen dives after Ishiba resigns",
      "url": "https://www.nst.com.my/business/corporate/2025/09/1271844/fed-rate-cut-optimism-boosts-sentiment-yen-dives-after-ishiba",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T10:58:05Z",
      "summary": "SINGAPORE: Stocks rose and the dollar wobbled on Monday after dismal US labour data sealed the case for an interest rate cut this month, while the yen fell as investors girded for uncertainty in Japan following the resignation of Prime Minister Shigeru Ishiba.\nGold prices held near a record-high while US Treasury yields hovered close to five-month lows after data showed the world's largest economy",
      "content": "SINGAPORE: Stocks rose and the dollar wobbled on Monday after dismal US labour data sealed the case for an interest rate cut this month, while the yen fell as investors girded for uncertainty in Japan following the resignation of Prime Minister Shigeru Ishiba.\nGold prices held near a record-high while US Treasury yields hovered close to five-month lows after data showed the world's largest economy created far fewer jobs than expected in August, with markets factoring in chances of a jumbo rate cut.\nMuch of the focus last week was on elevated long-end bond yields across the globe as investors fretted about the state of various countries' finances from Britain and France to Japan.\nSome of those worries could return after Japan's Ishiba resigned on Sunday, leading to political uncertainty in the world's fourth-largest economy and clouding the policy path for the Bank of Japan.\nThe spotlight will be on who replaces Ishiba, with investors fretting that an advocate of looser fiscal and monetary policy, such as Liberal Democratic Party veteran Sanae Takaichi, who has criticised the BOJ's interest rate hikes, could take the helm next.\nYields on super-long Japanese government bonds (JGBs) have already been hovering near record highs, while Japan's Nikkei share gauge has recently slipped from last month's all-time peak.\n\"The markets are going to be framing this around what it means for fiscal policy, inflation and the BOJ's response,\" said Kyle Rodda, senior financial market analyst at Capital.com.\n\"I suspect this will weaken the yen a bit and could actually boost stocks. But the latter relies on some leadership certainty first, so the initial move could be a marginally weaker yen.\"\nThe yen fell across the board and was last 0.6 per cent lower at 148.39 per dollar, while the Nikkei surged 1.8 per cent, just shy of its recent record-high.\nMSCI's broadest index of Asia-Pacific shares outside Japan was 0.4 per cent higher. Blue-chip China stocks rose 0.3 per cent in early trading while Hong Kong's Hang Seng index gained 0.35 per cent.\nRATE CUTS ARE HERE\nThe prospect of an interest rate cut by the Federal Reserve later this month propped up stock markets while weighing on Treasury yields and the dollar.\nS&P 500 futures pointed 0.19 per cent higher in early Asian hours on Monday after a volatile session on Friday where the index hit a record high but then closed 0.3 per cent lower. European futures advanced 0.45 per cent.\nThe US two-year yields, which are tied to interest rate policy, were 2 basis points (bps) higher at 3.527 per cent, near the five-month low of 3.464 per cent hit on Friday.\nInvestor attention this week will be on the US inflation report on Thursday to gauge the risk of rising prices that could help temper some of the enthusiasm for a larger rate cut.\n\"While most investors remain aligned on a 25-basis-point cut at the September Fed meeting, we expect market focus to shift toward calls for a larger move, with a 50bp cut now in play,\" said Harun Thilak, head of global capital markets North America at Validus Risk Management.\nTraders have fully priced in a 25 bp cut later this month with 8 per cent chance of a jumbo 50 bp rate cut, the CME FedWatch tool showed. They are anticipating 68 basis points of easing by the end of this year.\n\"The Fed has more than enough reasons and will cut by 25bps ... with another two within six-months,\" said George Boubouras, head of research at K2 Asset Management.\n\"US cash rates are notably higher than other developed markets (and) given the resilient and robust US economy, lower cash rates are now required. Fed commentary of further rate cuts will be supportive, without this equity markets will be weaker.\"\nIn the currency market, the euro eased a bit to US$1.1713 after surging 0.6 per cent on Friday, while sterling last fetched US$1.3492 after a 0.5 per cent rise on Friday.\nInvestor attention will also be on France where Prime Minister Francois Bayrou faces a confidence vote on Monday, which he is expected to lose, plunging the euro zone's second-largest economy deeper into political crisis.\nIn commodities, gold prices were at US$3,588 per ounce, just shy of the US$3,600 milestone. Gold is up 37 per cent this year after rising 27 per cent in 2024.\nOil prices climbed after OPEC+ agreed over the weekend to raise output at a slower pace from October on expectations of weaker global demand. Brent crude and US West Texas Intermediate crude rose about 1 per cent each.\n© New Straits Times Press (M) Bhd"
    }
  ]
}