{
  "asOf": "2025-09-08T06:21:38Z",
  "items": [
    {
      "id": "e05e739ec0fbf3af",
      "title": "Madani  project at military camps to yield six tonnes of produce annually",
      "url": "https://www.nst.com.my/news/nation/2025/09/1271953/madani-project-military-camps-yield-six-tonnes-produce-annually",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T14:14:01Z",
      "summary": "KUALA LUMPUR: The Madani Economy project in armed forces camps nationwide is expected to yield up to six tonnes of produce annually and generate income of RM604,000 over the next two and a half years.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said the programme involves families of armed forces personnel and will be implemented in phases across all 90 military camps nationwide to benefit t",
      "content": "KUALA LUMPUR: The Madani Economy project in armed forces camps nationwide is expected to yield up to six tonnes of produce annually and generate income of RM604,000 over the next two and a half years.\nDefence Minister Datuk Seri Mohamed Khaled Nordin said the programme involves families of armed forces personnel and will be implemented in phases across all 90 military camps nationwide to benefit their communities.\n\"Initially, the project was run on a trial basis to gauge the interest of personnel's wives, and it turned out that demand was high.\n\"The government has allocated RM10 million for this initiative. For the stingless bee honey (madu kelulut) project, Boustead Plantations will cover half the cost of the hives while the government will bear the other half.\n\"We are starting with 22 camps, before gradually expanding it to 90 camps within two and a half years,\" he told reporters at a press conference after visiting the army's Western Field Command Headquarters in Sungai Besi, here.\nHe said all harvested produce would be purchased by Boustead Plantations Bhd, a subsidiary of the Armed Forces Fund Board (LTAT), to be processed into higher-value products. The profits from the company, he added, would also benefit armed forces personnel in the future.\n\"For the herbal planting initiative, it began here at Kem Perdana, Sungai Besi, with pandan, lemongrass and now ulam raja, while the company interested in purchasing them is a start-up from Universiti Putra Malaysia (UPM). Once the entire ecosystem is ready, then it will be suitable to implement it elsewhere,\" he said.\nKhaled said that so far, Mahkota Camp in Kluang had already begun harvesting, providing a modest income but with strong potential to yield significant returns for about 20 families involved in the Madani Economy project there in the near future.\nHe also hoped that the programme would create opportunities for armed forces' families to participate in government-driven economic activities, ensuring that military camps would not be left out of the initiative's benefits.\n© New Straits Times Press (M) Bhd"
    },
    {
      "id": "9a4d19d1f1c7fa2d",
      "title": "Sorensen-McGee scores a hat-trick as Women's World Cup holders New Zealand thrash Ireland",
      "url": "https://www.nst.com.my/sports/others/2025/09/1271951/sorensen-mcgee-scores-hat-trick-womens-world-cup-holders-new-zealand",
      "source": "New Straits Times",
      "publishedAt": "2025-09-08T14:12:36Z",
      "summary": "LONDON: Teenage rising star Braxton Sorensen-McGee grabbed a hat-trick of tries as reigning champions New Zealand secured top spot in Pool C of the Women's Rugby World Cup with an emphatic 40-0 rout of Ireland in Brighton.\nVictory saw the record six-time World Cup winners gain revenge for their shock 29-27 loss to Ireland at last year's WXV tournament in Vancouver, with 18-year-old wing Sorensen-M",
      "content": "LONDON: Teenage rising star Braxton Sorensen-McGee grabbed a hat-trick of tries as reigning champions New Zealand secured top spot in Pool C of the Women's Rugby World Cup with an emphatic 40-0 rout of Ireland in Brighton.\nVictory saw the record six-time World Cup winners gain revenge for their shock 29-27 loss to Ireland at last year's WXV tournament in Vancouver, with 18-year-old wing Sorensen-McGee leading the way on Sunday as the Black Ferns scored six tries in total.\nBoth teams had already reached the quarter-finals before kick-off in their concluding pool game on England's south coast, with the only outstanding issue the finishing order.\nBut New Zealand's third win from as many group matches means they will now face the loser of Sunday's Pool D clash between France and South Africa in the last eight.\n\"Job done, pretty proud of that one,\" said New Zealand coach Allan Bunting.\n\"Scott (Bemand) and the Irish ladies really threw everything at us and put us under a lot of pressure but we were formidable on D (defence), we didn't want to let them past and that's what it's going to take to go further in this competition.\"\nIreland, who will now take on the Pool D winners in the last eight, were unable to break down a dogged New Zealand defence, having defiantly stared down the Black Ferns' pre-match Haka challenge.\nA tough day for Ireland was made worse by full-back Stacey Flood leaving the field in a protective boot and centre Eve Higgins going off the pitch for a head injury assessment.\n\"New Zealand are a physical team so we've got to find a way to cross the whitewash when we get those opportunities,\" said Ireland coach Bemand.\nEarlier in Pool C, Japan bid farewell to this World Cup by overturning a nine-point deficit at half-time to beat Spain 29-21 in York.\nBoth sides were bidding for their first win of the tournament and Spain were well-placed when leading 14-5 at the break.\nJapan, however, scored three tries in 16 minutes in the second half before Spain lost Anne Fernandez de Corres to a yellow card.\nJapan coach Lesley McKenzie was proud of how her side regrouped at half-time.\n\"(I told them) to collect all the positives, which were numerous in the first half, and keep some patience and we will get the rewards in the second half,\" she said.\n\"We were in control in terms of territory and possession but a little impatient, which is one of our vices... have some faith in the process, and we got there..\"\nIn another match between two previously winless sides at the tournament, Italy hammered Brazil, the first South American team to compete at a Women's Rugby World Cup, 64-3.\nLe Azzurre ran in 12 tries, six in each half, with Francesca Granzotto and Vittoria Ostuni Minuzzi both scoring hat-tricks.\nFor Italy there was the frustration of what might have been after losses to France and South Africa put paid to their quarter-final hopes.\nNevertheless, Italy coach Fabio Roselli said: \"I am very proud. We have a lot of young players, who are at their first Rugby World Cup. They show great potential.\"\nBrazil counterpart Emiliano Caffera was proud that his side had shown \"the world Brazil has rugby 15s\" but pleaded for an enhanced fixture schedule in order to improve after a third heavy defeat in England.\n\"Now what we need is more games, more tournaments, more support,\" he insisted. \"We play two or three games a year; I want to play nine, 10, 12 games a year.\" - AFP\n© New Straits Times Press (M) Bhd"
    },
  ]
}
